[IDR_HLTYPE]
IDR_HLTYPE_SUBMENU_0 =File(&F)
IDR_HLTYPE_SUBMENU_1 =Edit(&E)
IDR_HLTYPE_SUBMENU_2 =Draw(&D)
IDR_HLTYPE_SUBMENU_3 =Modify(&A)
IDR_HLTYPE_SUBMENU_4 =Tool(&T)
IDR_HLTYPE_SUBMENU_5 =View(&V)
IDR_HLTYPE_SUBMENU_6 =System parameter(&S)
IDR_HLTYPE_SUBMENU_7 =Mark(&M)
IDR_HLTYPE_SUBMENU_8 =Window(&W)
IDR_HLTYPE_SUBMENU_9 =Help(&H)
IDR_HLTYPE_SUBMENU_10=

[IDR_HLTYPE_SUBMENU_0]
57600 =New(&N)	Ctrl+N
57601 =Open(&O)...	Ctrl+O
57602 =Close(&C)
57603 =Save(&S)	Ctrl+S
57604 =Save as(&A)... 
0 =----------------------
306     =Import(&I)...
33156 =Import a G Code file(*.NC)
0 = ----------------------
57607 =Print(&P)...	Ctrl+P
57606 =Print setup(&R)...
0 = ----------------------
57616 =Most recently used file
0 = ----------------------
57665 =Exit(&X)

[IDR_HLTYPE_SUBMENU_1]
57643 =Undo(&U)	Ctrl+Z
57644 =Redo(&R)	Ctrl+Y
0 =----------------------
57635 =Cut(&T)	Ctrl+X
33419 = Copy(&C)         Ctrl+C
57637 =Paste(&P)	Ctrl+V
32791 =Delete(&D)	Del
57642 =Select all(&A)	Ctrl+A
0 = ----------------------
32828 =Combine(&G)	Ctrl+G
32829 =UnCombine(&U)	Ctrl+U
33131 =Group
33132 =Ungroup
33040=Convert to One Object(&U)\tShift+U
0 = ----------------------
33415=Convert  to Bitmap
33011 =Convert to Line
33413 =Convert to Swing Line
0 = ----------------------
33235 =Convert Excel To TXT
33229 =Batch Replace Text
0 = ----------------------
32832 =Option(&O)...

[IDR_HLTYPE_SUBMENU_2]
32821 =Click(&C)
0 =----------------------
307     =Hand draw(&H)
33097 =Spline
32813 =Rectangle(&R)
32814 =Ellipse(&E)
33113 =Arc1
33115 =Arc2
33117 =Circle
32815 =Polygon(&P)
32816 =Grid(&G)
33129 =Point(&D)
33244 =Sprial
0 = ----------------------
308     =Text Serial(T)
32919 =Barcode(&B)
0 = ----------------------
33092 =Delay(&D)
33093 =Input(&I)
33094 =Output(&O)
33138 =Motion Control(&M)
33139 =Motor Positon(&S)
33141 =Condition(&C)
33189 =Laser Control
33198 =CCD
33200 =Position Cali
0 = ----------------------
32820 =Hatch(&F)

[IDR_HLTYPE_SUBMENU_3]
32940 =Array Arrangement(&A)...
0 =----------------------
33399 =Transform Object
33409 =Plastic
IDR_HLTYPE_SUBMENU_3_0 =Transform(&C)
IDR_HLTYPE_SUBMENU_3_1 =Sort
IDR_HLTYPE_SUBMENU_3_2 =Curve Edit
33027 =Point Filter(&F)	Ctrl+F
33426 =Interface UI skin

[IDR_HLTYPE_SUBMENU_3_0]
32901 =Center(&M)	Ctrl+M
0 =----------------------
32913 =Rotate 90 Degrees Counter-Clockwise(&L)
32914 =Rotate 90 Degrees Clockwise(&R)
0 = ----------------------
32907 =X Mirror(&X)
32908 =Y Mirror(&Y)
0 = ----------------------
33040 =Convert to One Object(&U)	Alt+U

[IDR_HLTYPE_SUBMENU_3_1]
33029 =Manual Sort(&M)	Shift+M
33030 =Auto Sort(&A)	Shift+A
33068 =Select Sort(&S)	Shift+S
33246 =Auto Sort 2
33245 =SortObjbyLay
33079 =Path Optimization
33080 =Reset Sort

[IDR_HLTYPE_SUBMENU_3_2]
33182 =Break Cross Point
33076 =Auto Connect
33241 =Remove Overlap Line
33205 =Broaden

[IDR_HLTYPE_SUBMENU_4]
33162 =Locate Focus
33220 =Text separation
33136 =Auto Group Objects
33184 =Assistant Point
33142 =Ruler Tool
33224 =Measure Distance
33225 =Measure Angle

[IDR_HLTYPE_SUBMENU_5]
59392 =System Toolbar(&T)
132     =Zoom Toolbar(&S)
131     =Draw Toolbar(&D)
33275 =Object Operate Toolbar
33406 =Draw 3D Toolbar
33407 =Draw Other Toolbar
33408 =Align Toolbar
0 =----------------------
59393 =Tracker Setup(&r)...
33008 =Object List Dialog
33009 =Property Dialog
0 = ----------------------
33074 =IO Check(&T)...

[IDR_HLTYPE_SUBMENU_6]
32841 =Hardware Configuration(&H)...
33425 =Language
33053 =Hotkeys(&K)
33085 =User Font(&F)
0 =----------------------
33054 =Rights Manager(&R)
33059 =Change User(&X)
33130 =Log Off(&L)
0 = ----------------------
33001 =Gray Current Compensate(&G)...
33002 =Gray NonLinear Compensate(&P)
33414 =Convert Vector to Bitmap Set
0 = ----------------------
33077 =Calibrate Setting(&C)
33422 =9 Points Calibration
33254 =3D Calibrate Setting
33230 =3D BOX Compensate
33256 =Fly Mark Setting
33165 =Motion Parameter Setting
33236 =Serial Port Setting
0 = ----------------------
33402=Set Card Alias
33145=Switch Card
0 = ----------------------
33262 =Test Laser

[IDR_HLTYPE_SUBMENU_7]
32779 =Normal Mark(&N)...	F10
33137 =Rotate Mark(&R)....
32951 =Multi-Document Mark(&M)...	F8
33211 =Move Mark...
33251 =Multi-Card Mark
33258 =Fly Mark
0 =----------------------
33062 =Red Light Preview
32783 =Mark Preview(&P)...	F9
0 = ----------------------
33061 =Online I/O Select Document Download(&S)
33086 =Offline I/O Select Document Download(&O)
33072 =Download Selected
33073 =Clear Downloaded Data

[IDR_HLTYPE_SUBMENU_8]
57648 =New window(&N)
57650 =Cascade(&C)
57651 =Tile horizontally(&T)
57649 =Arrange(&A)

[IDR_HLTYPE_SUBMENU_9]
57664 =About HBM(&A)
33147 =Extend Function
33168 =New Feature
IDR_HLTYPE_SUBMENU_9_0 =Help(&H)
33218 =EMCC run Information
33238 =ParaFileImport
33239 =ParaFileExport

[IDR_HLTYPE_SUBMENU_9_0]
33193 =Chinese
33194 =English

[ID_CHANG_DLG]
CAPTION = 
2149 =Position
2150 =Size(mm):
1405 =Scale
1730 =Absolute position:
2151 =Rotation angle:
2152 =Rotation axis:
2153 =Zoom (%):
1404 =Applied to reproduction
1 =Apply
1492=
2500=
1494=
1502=
1503=
1506=
1504=
1505=
1507=
1508=
1535=
1398=Button
2146=
1678=
1729=
1511=

[ID_CHANG_DLG_OTHER]
CAPTION = Dialog
2155 = Shear Angle
1403 = Center
1685 = Expand
1 = OK
2 = Cancel

[IDD_ABOUTBOX]
2158 =Software version information
1475 =Serial Number:
1843 =DogId Info:
2159 =Integrator ID
2160 =device ID
CAPTION=About HBM


[IDD_ARRAY]
CAPTION =Array arrangement
1263 =Standard
1645 =Vertical priority
1646 =Horizontal priority
1647 =Row mode
1648 =S mode
1649=Offset spacing
1650=Boundary spacing
2161 = Rows
2162 = Columns
2163 = Row spacing (mm)
2164 = Columns spacing (mm)
1239 =Custom
1265 =Refresh
1256 =Add...
1266 =Edit...
1186 =Delete
1780 =Template
1778 =Import Template
1779 =Export Template
2165 =Object rotation in degrees
1772 =Rotate
2166 = Shifting
2167 = LeftX
2168 = RightX
2169 = LeftY
2170 = RightY
1785 =Set
1410 =Serial auto-increment
1258 =Save style...
1298 =Load style...
2171 = Marking test
1634 =Red
1492 =Laser
1013 =Mark
1019 =Apply
1 =OK
2 =Cancel
1218=
1012=
1242=
1006=
1303=List1
2160=
1769=
1781=
1782=
1783=
1784=
1502=
114=MINI

[IDD_ARRAYPOS]
CAPTION=Coordinate setting
1070=
1071=
1=OK
2=Cancel
2065=X coordinate (mm)
2066=Y coordinate (mm)
1072=
2151=R rotation (degrees)

[IDD_BAR_PAGE]
CAPTION=
1499=Reverse
1502=
1637=
1013=
1282=
1162=
1029=
1717=Better
1339=Connect
1722=
1723=
1848=Dot Matrix
1849=
1718=Auto Fill
1951=Parity
1724=
1500=Center Hollow
1503=
1850=
1973=IDD_BAR_PAGE_COMBOBOX_0
1912=Default language
1974=Language Enable
1535=Loop
1283=
1284=
1952=Combine
1501=QR Locator Hollow
1504=
1852=
2095=IDD_BAR_PAGE_COMBOBOX_1
2096=
2097=Circle
1493=Rectangle
2098=Dotty
2157=Width(mm)
680=Aspect ratio(%)
2155=Indent(mm)
2154=Height(mm)
1750=Line space(mm)
2104=Angle
1413=Single Line Mark Count:
2159=Narrow Line Count:
2158=HeightR(mm)
2160=Radius(mm)
2164=Width(mm)
2166=Height(mm)
2168=Language:
2161=Precision
2162=Sample Count
2165=Width(mm)
2167=Height(mm)
2163=Mark order:

[IDD_BAR_PAGE_TEXT]
CAPTION=
1504=Fixed part
1623=Serial
1624=Date & time
1343=Set...
1627=
1626=%Y/%m/%d,%H:%M:%S
1628=TEXT
1635=
1034=
1398=Add
1403=Delete
1621=Modify
2186=Text content
1625=Serial comm
1629=Network comm
2161=Port:
2162=Baud rate:
2163=Data bits:
2164=Stop bits:
2165=Parity check:
2166=Command:
2167=IP:
2168=Port:
2155=Parameter
2170=Unicode
2171=Overtime:
2173=ms
2174=Communication set

[IDD_SPLASH]
CAPTION=


[IDD_DIALOG_PROPRETY]
CAPTION=
1248=
1250=Same as layer0
1260=
1258=Save as...
1262=Delete
1263=Default
1541=Mark Selected
1256=List2
1403=
1404=
1405=
1406=
1407=
1408=
1409=
1682=Fill
1662=Tab1
1264=spot

[IDD_MARK_DIALOG]
CAPTION=
2175 =RedPreview(F1)
2052=Fast Mark(F7)
2053 =Normal Mark(F10)
2054=Muldoc Mark(F8)
2085=[S]Mark Selected
2055=Param
1740=[C]Mark Loop
2093=0
2094=1
2092=R
1741=Show Contour
1742=Continue Mode
2095=0:0: 0.000s
2096=00:00:00s
2131=
2134=Multi-Card
Mark
2153 = Part:
2154 = Total:
2420 = Card:
2167=IDD_MARK_DIALOG_COMBOBOX_0

[IDD_DIALOG_OBJECT_LIST]
CAPTION=
1034=List1

[IDD_DIALOG_OBJEDITFILL]
CAPTION=
1821=Fill1
1822=Fill2
2033=Fill3
1825=KeepAngle
1162=
1029=
1828=
1826=Equalize Distance
1827=
1831=
1830=
1829=
1820=Enable
1823=
1657=
1649=
1632=Delete Loop-Contour
1658=
1833=Delete Fill
1836=FillFirst
1850=Progression
1526=Align
1834=
2031=Outer
2032=random first
2056=Fill Same 
2077=Mark Fill Only
2213=Distance(mm)
2287=Start Offset(mm):
2104=Angle(Deg)
2239=Beamcomp(mm):
2286=Minimal Jump(mm):
2290=Startreduction(mm):
2288=End Offset(mm):
2196=Type
2292=Numloops:
2293=DistanceLoop(mm):
2291=Endreduction(mm):
2182=Expand spacing:

[IDD_TEXTEDIT_DLG]
CAPTION=
1034=
1765=Add
1763=Delete
1825=Text type
1822=IDD_TEXTEDIT_DLG_COMBOBOX_0
1635=
1626=
1343=Serial set...
1627=TEXT
1628=              
1507=Model
1801=
1823=Font type
1824=IDD_TEXTEDIT_DLG_COMBOBOX_1
1809=file name
1331=
1344=TTF set...
1807=Chinese:
1328=
1808=English:
1329=
1475=Figure:
1330=
1828=Height(mm)
1013=
1766=Advance
1821=
1827=
1826=
1764=Modify
1820=
1830=
1829=  TTF...
1846=Chinese:
1847=Eng/Num:
1845=
1031=
2072=file name
2073=
2500=Extended attribute
681=Alias
61567 = Log

[IDD_TEXTEDIT_DLG_FONTTYPE]
61498 = TTF font
61499 = SHX font
61500 = User font
61511 = Matrix font
61546 = Fnt font

[IDD_TEXTEDIT_DLG_TEXTTYPE]
61495 = Fix text
61496 = Serial
61497 = Time
182 = Serial text
183 = Network text

[IDD_DIALOG_BAREDIT]
CAPTION=
1820=
1030=
2180=BarType                       
1398=Set
1034=
1765=Add
1763=Delete
1825=Text type
1822=IDD_DIALOG_BAREDIT_COMBOBOX_1
1635=
1626=
1343=Serial set...
1627=
1628=
1507=Model
1801=
1766=Advance
1764=Modify
2210=extended attribute
2211=Alias

[IDD_SET_NODEDELAY]
CAPTION=
1389=
2467=Delay duration (ms):

[IDD_SET_NODEINPUT]
CAPTION=
1499=
1015=
1016=
1017=
1018=
1019=
1020=
1021=
1022=
1023=
1024=
1025=
1026=
1027=
1028=
1029=
1014=
1030=
1031=
1032=
1033=
1034=
1035=
1036=
1037=
1038=
1039=
1040=
1041=
1042=
1043=
1044=
2468=Significant bit
2469=Set value


[IDD_SET_NODEOUTPUT]
CAPTION=
1499=
1015=
1016=
1017=
1018=
1019=
1020=
1021=
1022=
1023=
1024=
1025=
1026=
1027=
1028=
1029=
1014=
1030=
1031=
1032=
1033=
1034=
1035=
1036=
1037=
1038=
1039=
1040=
1041=
1042=
1043=
1044=
1500=
1045=
1046=
1047=
1048=
1049=
1050=
1051=
1052=
1053=
1054=
1055=
1056=
1057=
1058=
1059=
1060=
1061=
1062=
1063=
1064=
1065=
1066=
1067=
1068=
1069=
1070=
1071=
1072=
1073=
1074=
1075=
1389=
2468=Significant bit
2469=Set value
2349=Pulse width
2470=Signal duration (ms):
2471=Output level signal when the duration is 0, and output pulse signal when it is greater than 0

[IDD_DIALOG_OBJINFO_ARC]
CAPTION=
1502=
1503=
1504=
1505=
1506=
1507=
1508=
1510=
1511=
2294=Starting point X coordinate (mm)
2295=Starting point Y coordinate (mm)
2296=Center X coordinate (mm)
2297=Center Y coordinate (mm)
2298=End point X coordinate (mm)
2299=End point Y coordinate (mm)
2300=Arc radius (mm)
2301=Starting angle (degrees)
2302=Endpoint angle (degrees)


[IDD_DIALOG_OBJINFO_CIRCLE]
CAPTION=
1504=
1505=
1072=
2315=Center X coordinate (mm)
2316=Center Y coordinate (mm)
2317= Radius (mm)

[IDD_DIALOG_OBJINFO_MOTORPOS]
CAPTION=
1502=
1868=
1503=
1869=
1504=
1870=
1505=
1871=
2322=0 Axis Position
2323=1 Axis Position
2324=2 Axis Position
2325=3 Axis Position
2501=mm
2502=mm
2503=mm
2504=mm


[IDD_DIALOG_OBJINFO_BUFFER_LASER]
CAPTION=
1882=Laser Off
1959=Laser On
1507=
1503=
1217=
1013=
1506=
2303=Control Properties
2304=Laser parameters
2305=Q-frequency (KHZ)
2306=Q release (us)
2307=Current (A)
2308=Energy (%)
2309=Mode

[IDD_DIALOG_OBJINFO_CCD]
CAPTION=
1506=
1012=
1504=
1963=Set position
1070=
1071=
1030=IDD_DIALOG_OBJINFO_CCD_COMBOBOX_0
1031=
1505=
2310=Template number
2311=Retry count
2312=Timeout
2313=NG treatment
2222=Baud rate
2314=Jump delay
2065 = X(mm)
2066 = Y(mm)

[IDD_DIALOG_OBJ_POSCALI]
CAPTION=
1962=Disable cali
2500=Enable cali
2283=Correction type

[IDD_DIALOG_EDITFILL]
CAPTION=
1732=Apply
1662=Tab1
1764=FastMark(F7)
1795=Download(F11)

[IDD_MARK_NORMAL]
CAPTION=Mark
1013=Start(&M)
1014=Stop(&E)
2=Exit(&X)
1012=
1492=Mark
1634=Red Preview
1543=Frame Preview
2422=Total number of markings:
1413=Number of markings:
2405=Single time:
1475=
1263=
2423=Total time:
2436=Free time:
1414=Marking time:
1264=
1265=
1266=
1267=
1396=Refresh
2433=Working mode:
1740=Loop Mark
1502=
2425=Interval time (ms):
1034=
1794=
1803=
1804=
1724=Red
1903=Motor Home
1742=Continue Mode
2208 =Marking statistics

[IDD_CALI_3DBOX]
CAPTION=3D Box Cali
1013=Mark
2006=
1503=
1258=Save
2005=
1173=
1174=
2173=1 Correction settings
1260=Make Cali Level
2174=2. Mark and measure the measured value
1820=Enable 3D Box Cali
1261=Make Cali file
1822=Focus
2169 = BOX(mm)
2170 = Z min(mm)
2171 = Z max(mm)
2172 = Interval(mm)


[IDD_DIALOG_3DALIGN]
CAPTION=Model move
1070=
1071=
1172=
1927=x
1928=y
1929=z
1925=Model center
1900=Move
1901=Quit

[IDD_DIALOG_3DMARK_ADJUST]
CAPTION=3D打标调试
2198=STL模型高级贴图
2201=对位、对焦
2002=
2199=贴图引线:
2003=
2200=贴图间距:
1162=
2001=贴图预览
1019=应用
2005=红光预览
1020=打标
2004=
2203=3D采样点:
2007=边框对位、对焦模式
2179=精度:
1502=
2202=模型移动:
2006=
1259=移动
2009=Y+
2010=X+
2011=Y-
2012=X-


[IDD_DIALOG_ADDFILLSET]
CAPTION=Progression Fill Set
1=OK
2=Cancel
2204=Fill Count
2205=Increase Distance(mm)
2206=Increase Angle(Deg)
1220=
1503=
1504=
1877=Remark contour
65535=Increase Angle(Deg)

[IDD_DIALOG_ADDUSER]
CAPTION=Add User
1=OK
2=Cancel
2207=UserName:
1502=
2208=Password:
1503=
2209=Confirm Password:
1504=

[IDD_DIALOG_BROADEN]
CAPTION=Set
1=OK(&O)
2=Cancel(&C)
1750=Line width:
1196=
2213=Spacing:
1504=

[IDD_DIALOG_CHANGECARD]
CAPTION=Switch Control Card
1=OK
2=Cancel
1908=
2214=Please select the control card you need to use:

[IDD_DIALOG_CHANGEOBJNAME]
CAPTION=Rename
1=OK
2=Cancel
2215=New Name:
1502=

[IDD_DIALOG_CHECKLICENCE]
CAPTION=Check License
2057=
2058=
2217=Dongle ID:
2059=NULL
2218=Material code:
1220=NULL
2216=Reminder information:
2061=
2219=The current customized software's first license free dongle ID:
2062=

[IDD_DIALOG_COMSET]
CAPTION=Serial Port Set
1=OK
2=Cancel
2034=Enable
2221=Serial port number:
2222=Baud rate:
2223=Data bits:
2224=Stop bit:
2225=Inspection：
2035=
2036=
2037=
2038=
2039=
2045=MarkStart
2046=MarkEnd
2047=EnterMarkEnv
2048=LeaveMarkEnv
1502=
2220=Command:

[IDD_DIALOG_CONNECTSPACE]
CAPTION=Set connect space
1=OK
2=Cancel
2226=Connect space:
1162=

[IDD_DIALOG_DCPMSG]
CAPTION=Marking card status
1=OK
2=Cancel
1723=Close software
1724=Red light
1725=
1728=

[IDD_DIALOG_EDITUSERNAME]
CAPTION=Modify User Name
1=OK
2=Cancel
2227=User Name:
1711=
2228=New User Name:
1503=


[IDD_DIALOG_EDITUSERRIGHTPASSWORD]
CAPTION=Modify Password
1=OK
2=Cancel
2207=User Name:
1502=
2230=New Password:
1709=
2231=Comfirm Password:
1710=
2229=Old Password:
1505=


[IDD_DIALOG_EXCELTOTXT]
CAPTION=Excel To TXT
1=Create TXT
2017=
2018=Input Excel Data
2019=Refresh Data
2020=
2021=
2022=Star-Row:
2023=Star-Col:
2024=
2179=File path:
2025=Get-Col:
2026=

[IDD_DIALOG_EXTERNVIEW]
CAPTION=Expand Object
1=OK
2=CanCel
1746=Static
1682=
1750=Line spacing:
1751=Shrink and expand edges
1726=Delete original object
684 = Apply
1748=Explanation: If the line spacing is positive, the object expands outward; otherwise, the object shrinks inward.
1672=Applicable page
1749=Whether to optimize
1415=Advanced scaling
0=

[IDD_DIALOG_FASTMARKSTOP]
CAPTION=
1=Stop
1392=

[IDD_DIALOG_FILLOBJMARKSET]
CAPTION=
1737=
1738=Border
1736=Filling
1743=Fill first
1502=
1734=
2235=Edit each marking method
2236=Parameter selection:
2234=Number of object markings:
1413=Number of markings:
1034=List1
1744=
1745=Enable
1690=save
1742=
1691=delete
1746=Reverse marking

[IDD_DIALOG_INTENSITY]
CAPTION=BMP Intensity
1=Ok
2=Cancel
2237=Gray scale display range:
1634=
1635=
1636=
1881=List2


[IDD_DIALOG_INTERSPACE]
CAPTION=Break intersection point
1=OK(&O)
2=Cancel(&C)
2238=Intersection length                                                 
1502=                                                                                                                                                           

[IDD_DIALOG_LASERDOT]
CAPTION=Spot Diameter
1=OK
2=Cancel
1897=
2239=Spot size:
1196=
2240=Speed:
1503=
2241=frequence:
1011=
2242=Spot spacing:
1504=
1970=Speed unchanged
1971=Frequency  unchanged
1972=Space unchanged
1267=
1969=

[IDD_DIALOG_MODEL]
CAPTION=Model
1956=
2137=
1957=
2138=
2139=Weld
2140=keep the original object
2141=keep target object
1414=Weld

[IDD_DIALOG_MODIFYZ]
CAPTION=Set coordinates
1=OK
2=Cancel
2245=Z coordinate:
1172=
2244=Y coordinate:
2243=X coordinate:
1071=
1070=

[IDD_DIALOG_MOTIONINFO_SET]
CAPTION=Motion Setup
1867=Absolute
2501=Relative
1545=Home
1=Exit& Save
2=Exit(&C)
2247=Axis number
1864=
2248=Motion axis type
1853=IDD_DIALOG_MOTIONINFO_SET_COMBOBOX_1
2259=Screw spacing (mm):
1502=
2250=Delay after completion of movement (ms)
1389=
2254=Motor rotation direction
1865=Forward
1394=Reverse 
2261=Translation air travel speed (mm/s):
1855=
2260=Translation working speed (mm/s):
1856=
2262=Translation back to zero high speed (mm/s):
1857=
2263=Translation back to zero low speed (mm/s):
1858=
2257=Rotating airspeed (deg/s)
2256=Rotating working speed (deg/s)
1859=
1860=
2252=Air travel acceleration time (s)
1861=
2251=Work acceleration time (s)
2253=Zero return deceleration time (s)
1862=
1863=
2249=Pulses per revolution
1503=
2246=Basic parameters
2258=Rectilinear motion
2255=Rotational motion
2264=Exercise testing
2267=Exercise volume (deg/mm):
1878=
1153=Run
2265=Sports mode:
2266=Type of motion:
1880=Work Move
1544=Empty Move
1901=Set current position as software org
1902=Auto move to home
1905=Motor Enable
1019=Apply(&A)
1906=Machine Org
2167 = Detection limit

[IDD_DIALOG_MOTIONINFO_SET_COMBOBOX_1]
0=Translation axis
1=Rotation axis

[IDD_DIALOG_MOVEMARK_SET]
CAPTION=Move Mark set
1=OK
2=Cancel
2153 =Get it automatically
2273=Diameter of workpiece marking surface (mm)
2274=Marking angle (deg)
1502=
1503=
2272=Circumference
2275=Offset of center point in X direction (mm)
1070=
2279=Encoder pulses per revolution (pulses/revolution)
2269=Translation
2270=Effective range (mm）
1072=
1073=
1976=Wheel Mark
1403=
1404=
2271=Position feedback pulse (pulse/mm)
1074=
1978=
1071=
2280=Encoder delay (us)
1389=
2281=Pulses per revolution
1504=
2282=Motor rotation direction
1865 = forward direction
1394=Backward
2276=(Document parameters)
2277=(Document parameters)
2278=(Document parameters)


[IDD_DIALOG_NOTADMIN]
CAPTION=Non administrator run warning
1978=When the local operating system is Win7 or above and the software is not running with administrator privileges, read and write permissions must be assigned to the software directory, otherwise it may not run properly!
2000=Next time you start the software, do not prompt again
1=OK

[IDD_DIALOG_OBJ_PRECISIONSET]
CAPTION=Precision Set
1=Ok
2=Cancel
2284=Fitting accuracy
2285=Number of samples per segment
1502=
1819=

[IDD_DIALOG_OBJ_TRANSFORM]
CAPTION=Object Transform
2100=
2099=
2101=
2102=
2103=
2104=Angle
1029=
2106=
2107=Position
2065=X
1070=
2109=
1071=
2111=
2105=°C
2066=Y
2108=mm
2110=mm
2112=
2127=Mirror
2113=
2114=
2115=Relative Position
2116=(mm,mm)
2117=
2118=
2119=
2120=
2121=
2122=
2123=
2124=
2125=
2126=Apply to Copy Object (C)
1414=Apply

[IDD_DIALOG_PARABTN]
CAPTION=Param
1=Exit
2086=Field
2055=Laser Control
2087=HardInfo

[IDD_DIALOG_PATHOPTIMIZE_SET]
CAPTION=Select the PathOptimize type
1=OK
2=Cancel
2328=Select Quick Sort Properties
1492=stroke first
1394=lay first
1835=The line sorting path is optimal, with the possibility of frequent layer changes. The layer sorting is based on layer order and objects within each layer are sorted, suitable for overlaying graphics. The line sorting path is optimal, with the possibility of frequent layer changes. The layer sorting is based on layer order and objects within each layer are sorted, suitable for overlaying graphics

  
[IDD_DIALOG_PORTSET]
CAPTION=Port Set
1=OK
2=Cancel
2329=Stop machining input port
2085=
1501=
1502=
1503=
1504=
1505=
1506
2332=Safe door
2333=Input Port
2074=
2051=
2334=Laser ready for output port
2335=Input Port
2075=
2052=
2336=Output port
2076=
2053=
2341=External red light indication output
2342=Output port
2077=
2054=
2343=Input Port
2078=
2055=
2339=Laser power output port
2340=Port
2079=
2056=
2345=Marking accompanying output
2346=Output port
2080=
2057=
2347=Marking end output port
2348=Output port
2081=
2058=
2331=Output port
2330=Output port when stopping processing
2083=
2060=
1507=Laser Alarm
2086=
2087=
2088=
2089=
2090=
2091=
2092=
2353=Input Port
2350=Fiber laser alarm output port
2084=
2061=
2349=Pulse width
2093=
1508=Q Pulse Reverse
2351=Output port
2082=
2059=
2352=Start marking port
2337=Software ready output port
2338=Output port
2095=
2099=
2183 = Stop machining output port
2184 = Output port
2185 = Software ready output port
2186=Output port
2187 =Input Port

[IDD_DIALOG_PROWAIT]
CAPTION=Wheel Data Processing
1403=Stop  
1877=Data processing, please wait patiently.....

[IDD_DIALOG_REMOVESAMELINE]
CAPTION=Remove Overlap Line
2050=
1014=Abort
2052=Size(mm):
2053=Remove redundant small objects
2054=
2051=Start
2055=Cancle

[IDD_DIALOG_RESETCARDNAME]
CAPTION=SetCardName
2233=CARD ID
2131 = 
2211=ALIAS
2133=
2132=Change

[IDD_DIALOG_ROTATEWHEEL_SET]
CAPTION=Rotate Setting
1=Ok
2=Cancel
2354=Diameter of workpiece marking surface (mm)
2355=Contour segmentation angle (deg)
1502=
1503=
2356=Number of markers per fill line
1504=
2276=(Document parameters)
2277=(Document parameters)
2278=(Document parameters)
2152=motor axis perpendicular to X-axis
2153=motor axis parallel to X-axis

[IDD_DIALOG_RULER]
CAPTION=Ruler Tool
1=Ok(&O)
2=Cancel(&C)
1882= Circle Ruler
1394=Line Ruler
2357=Circular diameter (mm):
2358=Scale spacing (degrees):
2293=Scale spacing (mm):
1502=
1883=
1884=
1897=
2359=Scale parameter
2360=Scale Start Value
1193=
2362=Total number of scales
1886=
2361=Scale increment
1887=
1894=Remove the last line
1893=List3
1384=Up
1385=Down
1220=Set
1899=Align Top
1898=Align Down
1900=
114=MINI
 2188 = RulerType

[IDD_DIALOG_RULEROBJ_SET]
CAPTION=Tick mark settings
1=OK
2=Cancel
2363=Number of intervals
2364=Decimal Places
1502=
1504=
1896=Show scale numbers

[IDD_DIALOG_SETLINEPOS]
CAPTION=Set the position of the measurement line
1=OK
1502=

[IDD_DIALOG_SETSORT]
CAPTION=Please enter a new serial number
1718=Modify Order
1719=Swap order
1502=
1=OK
2=Cancel
1720=Please enter a new serial number:

[IDD_DIALOG_SetSwing]
CAPTION=Swing Setting
1=OK
2=Cancel
2196=Type:
2241=Frequce:
2365=Vertical amplitude:
2366=Horizontal amplitude:
2143=
2144=
2145=
3000=IDD_DIALOG_SetSwing_COMBOBOX_0
2146=
2147=
2148=
2150=Peak spacing:
2151=Starting angle:
2149=Current marking speed:
682=mm（Range：>0）
2154=mm（Range：>0）
2155=mm（Range：>=0）
2152=mm（Range：>=1）

[IDD_DIALOG_SetSwing_COMBOBOX_0]
0=Nothing
1=sine
2=Circle

[IDD_DIALOG_SORTOBJ_LAY]
CAPTION=SortObjbyLayer
1=OK
2=Cancel
2064=
1384=Up
1385=Down


[IDD_DIALOG_SPIRAL_SET]
CAPTION = Spiral set
1=OK
2=Cancel
2367=Pitch:
2368=Minimum radius:
2369=Maximum radius:
2370=Increase in pitch:
2049=add inside
2050=add outside
2051=out to in
2052=
2053=
2054=
1503=


[IDD_DIALOG_TESTLASER]
CAPTION=Test Laser
1=Enter
2=Cancel
2103=
1503=
1504=
1505=
2375=Frequency (Q-frequency)
2376=Power
2307=Current
2378=Laser on time
1433=Open Laser
1506=
2128=Laser Pulse

[IDD_DIALOG_TEXTREPLACE]
CAPTION=Change Text
1=OK
2=Cancel
2211=Alias:
2002=
2379=Content:
2003=

[IDD_DIALOG_TRANBMP]
CAPTION=Dialog
1=OK
2=Cancel
2380=Conversion spacing (mm):
1162=
1649=Marking reciprocated
1505=
2385=Reciprocating alignment compensation:
1506=
2382=Row Merge Tolerance:
1507=
2384=Column conversion deviation value:
1650=Column resplitting is enabled
2381=Boundary extension (mm):
1163=
1508=
2386=Layer after conversion:
2383=Example spacing (mm):
2049=

[IDD_DIALOG_TRANSFORM]
CAPTION=3D Transform
1911=
1915=
1917=
1916=
2388=Move（mm）
2065=X
2066=Y
2104=Angle：
2067=Z
2151=Rotate
1492=Absolute(Center Point)
1394=Relative(Total Offset)
2501=Around Z
2500=Around X
1544=Around Y
1019=Apply
2=Quit
2389=Datum Shift
1502=
1912=Set Base
2387=Transformation type
1953=Only model
1546=2D change synchronous
1547=2D convert to 3D
1978=Tip: The center of rotation is the center point of the 3D model, rotating in the X/Y/Z direction.
2051=Reset
2104 = Angle

[IDD_DIALOG_USER_LOGIN]
CAPTION=Login
1461=
1=Ok
2=Cancel
2207=User Name:
2208=Password:
1715=
1331=

[IDD_DIALOG_USERRIGHTCFGMNG]
CAPTION=Rights Manager
1=OK
2=Cancel
1697=Normal Mark
1698=Multi-mark    
1699=Create Object
1700=Edit Object
1701=System Set
1702=Calibration
1703=Save File
1704=Open Document
1696=Layer Parameter
1706=Manager
2390=Permission selection
1707=List2
1713=Default User
1714=Import
1715=Export
1705=Super Parameter

[IDD_DRAW_DIB]
CAPTION=Bitmap setup
1493=Gray Pic
1657=Diff Pic
1658=Gray Dotmatrix
1292=Reverse color
1298=
1717=
1649=Loop
1505=
1508=
1510=
1506=
1398=GrayCurrent
1=OK
2=Cancel
2401=Number of acceleration points:
1504=
1502=
2395=Image Name:
2399=Marking settings:
2405=Single point time (us):
2241=Q frequency (KHz):
2400=Point alignment compensation:
2367=Point spacing (mm):
2396=Bitmap settings:
2397=Contrast (-1 to 1):
2398=Brightness (-1 to 1):
1509=
1511=
2403=minimum:
2404=maximum:
2402=Laser off delay (us):
2010=Gray Diff
2406=Marking direction
1645=Row First
2011=Column First
2196=Tip: Point spacing=K * Single step distance (K is an integer greater than or equal to 2), Single step distance=Marking speed/100000.
2049 = Automatic calculation (maintaining image resolution)
1650=Drop white Line	Threshold(0-255)
1651=Drop white leading and trailing

[IDD_DRAW_FILL]
CAPTION=Fill setup
1821=Fill1
1822=Fill2
2033=Fill3
1=ok
2=cancel
1825=KeepAngle
2407=Fill spacing (mm)
2287=Starting offset (mm):
2104=Angle (degrees)
1162=
1029=
1828=
1826=Equalize Distance
2239=Spot size (mm):
1827=
1831=
2408=Minimum jump spacing (mm):
1830=
2290=Indent at the beginning of the line (mm):
1829=
2288=End offset (mm):
1820=Enable
2196=type
1823=
2292=Number of expansion and contraction cycles:
1657=
1649=
1632=Delete Loop-Counter
2293=Shrink and expand spacing (mm):
1658=
1833=Delete Fill
1836=FillFirst
1850=Progression
1526=Align
1834=
2291=Indent at the end of the line (mm)
2031=Loop Outer
2032=Random  first
2056=Fill  Same Side First
2077=Mark Fill Only

[IDD_DRAW_GRID]
CAPTION=Grid setup
1=OK
2=Cancel
2161=Row:
1218=
2162=Column:
1219=
2409=Number of rows and columns

[IDD_DRAW_POLYGON]
CAPTION=Polygon setup
1220=
1234=Spin1
1221=Polygon
1222=Star
1223=Cross star
1238=Slider1
1232=
1=OK
2=Cancel
2411=Polygonal Style
2410=Polygon edges:
2412=definition:


[IDD_ELLIPSET]
CAPTION=ELLIP SET
1=OK
2=Cancel
2413=Measuring dimensions
1502=
2414=Explanation: The smaller the measurement size, the finer the ellipse.


[IDD_EXPORTPLT]
CAPTION=
1670=Non conductive filling
1671=Export at 100x magnification

[IDD_FILEREPLYRENAME]
CAPTION=Dialog
1=Replace
2=Rename
1658=

[IDD_GRAYCOMPENSATE]
CAPTION=GrayCompensate
1660=
1659=
1=OK
2=Cancel
1267=
1268=
1269=
1270=
1271=
1272=
1502=
1503=
1504=
1505=
1506=
1507=
1508=
1509=
1510=
1511=
1512=
1513=
3=Default

[IDD_HELPPATH]
CAPTION=关于帮助文件
1978=请参考："开始"->"程序"->"Hans Laser Application -> Hans Laser Marking software"->"UserManual"

[IDD_IMPORT]
CAPTION=
1549=Place Plt in Center
1550=Plt Better
1818=Preview
1817=Preview
1967=Normal type
1394=Fill line type
1965=X
2500=Y
2416=Fill Direction
2407=Fill Space
1966=
2415=Connection distance (mm)
1968=
1551=Connect

[IDD_MAKECP_SET]
CAPTION=Set up
1680=
1=OK
2418=Number of rings:
2417=Conical reproduction

[IDD_MARK_MULCARD]
CAPTION=Multi Card Marking
1014=selected card stopped
2=Exit
1492=marking
1634=red light preview
1543=border preview
1012=
1407=keyboard, mouse or foot triggered
1413=number of markings:
2429=single time:
2423=overall time:
1462=0
1463=0: 0: 0: 0.000
1464=0: 0: 0: 0.000
2430=working mode
1793=cycle marking
1502=
2425=interval time (ms):
2426=card list:
1386=
2427=associated document:
1388=
2428=document list:
1277=join association
1278=delete association
1015=start all
1016=stop all
2075=
2130=select card to start
1279=save multi card document
2177=enable
2184=marking document:
2178=save multiple documents
2183=IO input signal selection document mode
2179=move up
2180=move down
2055=input signal
2181=optional
2182=work record

[IDD_MARK_FLY]
CAPTION=Fly Mark
1013=Start(&M)
1014=Stop(&E)
2=Exit(&X)
1012=
1492=mark
1634=red preview
1543=frame
2421=Marking statistics
2422=Total number of markings:
1413=Number of markings:
2405=Single marking time:
1475=
1263=
2423=Total time:
1264=
1265=
1396=Refresh
2424=Laser mode:
1740=Loop Mark
1502=
2425=Interval time:
1034=
1794=
1803=
1804=
1724=red
2076=IO triggered automatic mark  
2213=Spacing:
2135=enable equal spacing
2136=
2147=

[IDD_MARK_PREVIEW]
CAPTION=Marking preview
114=MINI
2438=Preview speed
1268=Start
1014=Stop
1267=Slider1


[IDD_MARK_SPECIAL]
CAPTION=I/O Single Select Mul Doc
1013=Start(&M)
1014=Stop
2=Exit
1383=
1384=UP
1385=Down
1276=Delete
1220=Property
1012=
2439=Document Settings
1258=Save...
1413=Number of markings:
2405=Single time:
2423=Overall time:
1462=
1463=
1464=
1620=
1398=Current Singal
1622=Mark Current Document
2441= debug
1623=Befor Touch
2440=Signal source
2500=After Touch
1624=
2442=Marking Document:
1492=Mark
1634=Red PreView
1543=Fram View
2433=Working mode
1666=
2203 = Data Statistics

[IDD_MARK_WHEEL]
CAPTION=Rotation Mark
1870=Rotation Mark Statistics
2422=Total number of markings:
1475=
2423=Total time:
1265=
1413=Number of markings:
1263=
2436=Free time:
1266=
2405=Single time:
1264=
1414=Marking time:
1267=
1403=
2433=Working mode:
1492=Mark
1634=Red Preview
1852=Lossless(Segment by object,mark all)
1394=Equidistant contour(contour only)
1395=Advance(countour or vertical fillline)
1012=
1396=Refresh
1869=Home after mark end
1794=
1724=Red
1013=Start(&M)
1014=Stop(&E)
2=Exit(&X)
1740=Loop Mark
1502=
1034=
1803=
1804=
2444=Marking type
1903=Motor Home
2188=Line separation (mark the area with lines in blocks)

[IDD_MARKDATA_STAT]
CAPTION=Marking data statistics
1=OK
2445=Starting date of statistics:
2422=Total number of markings：
2446=Total marking time：
1365=
1413=
1414=

[IDD_MOVE_DLG]
CAPTION=Dot Move
1502=
1503=
1504=
1683=UP
1684=DWON
1685=LEFT
1686=RIGTH
1=OK
1940=Step:
1763=Mark
2065 = X direction (mm):
2066 =Y direction (mm):

[IDD_PENSELECT_DIALOG]
CAPTION=Select objects by pen number
1=OK
2=CANCEL
2088=

[IDD_SET_AZTEC]
CAPTION=Aztec
1=OK
2=Cancel
2002=Error Correct Level
1030=
1960=
2003 =version

[IDD_TEXT_PAGE_FNT]
CAPTION=
1809=file name
1331=
1838=Precision:
1330=
1344=TTF Set
1328=
1329=
1013=0
1345=0
1346=
1309=0
2486=Word height (mm)
2488=Width coefficient (%)
2487=Word spacing (mm)
1807=Chinese:
1808=English:
1475=Figure:
2485=font
2489=Row spacing (mm)
1681=
1310=
1499=Char.equal interval
1839=
1840=
1842=TTF
1841=SHX
1843=CUSTOM
1844=MATRIX
1846=Chinese:
1847=Eng/Num:
1845=
1031=
1956=Weld
1957=Inter filter
1311=
2213=Spacing:
1958=Broaden
1312=
1313=
1976=Dot Radius:
1314=
1315=
1977=Distance:
1959=Auto connect
1823=Font type:
1824=IDD_TEXT_PAGE_FNT_COMBOBOX_6
2071=Fnt
2072=file name
2073=
2206 = Distance:
2207 = Line Width

[IDD_TEXT_PAGE_ROUND]
CAPTION=
1023=Line arrangement
1323=Arc arrangement
1347=Left-align
1348=Right-align
1322=Middle-align
1005=
1196=
1193=
1312=Counter-clockwise
2317=Radius (mm):
2491=Starting angle (degrees):
1350=Characters face inward
2490=Direction (degrees):
1499=Custom format of character string
1502=
2492=(X output characters, N delete characters)
1964=Inverse
1349 = horizontal
1351 = vertical

[IDD_SET_BARTEXT]
CAPTION=Barcode text settings
1=OK
2=Cancel
1026=Tab1
2379=Text content
1508=

[IDD_SET_DATAMATRIX2D]
CAPTION=DataMatrix two-dimensional barcode setup
1=OK
2=Cancel
2447=Determine the following parameters based on barcode guidelines:
1476=Error correction type:
1030=
2279=Encoding format:
1954=
2450=Barcode size:
1955=

[IDD_SET_FLY]
CAPTION=Fly Marking Setting
1=OK
2=Cancel
1492=Constant speed Fly
1493=Coded Wheel Fly
2451=Constant speed of assembly line (mm/s):
1502=
2452=Diameter of speed coding wheel (mm):
1503=
2453=Pulse count per revolution of the speed coding wheel:
1504=
1499=reverse
2051=test
2454=Encoder testing
2455=Pipeline speed (mm/s):
1505=
2456=Encoder position (pulse):
1506=


[IDD_SET_GRIDMATRIX]
CAPTION=GridMatrix
1=OK
2=Cancel
2457=version
2458=Error Correct Level
2027=
2028=

[IDD_SET_HANXINCODE]
CAPTION=HANXIN Code setup
1=OK
2=CANCEL
2457=version
2458=Error Correct Level
1030=
1960=
2459=The Hanxin code coding module is provided by Beijing Renju Zhihui Technology Development Co., Ltd

[IDD_SET_IO]
CAPTION=Set document corresponding signal
1=OK
2=Cancel
1502=
1731=Obtain current signal (I9- I1)
2460=Signal setting (note: input port is 0 valid)
1499=
1015=
1016=
1017=
1018=
1019=
1020=
1021=
1022=

[IDD_SET_LANGREGION]
CAPTION=Select Language
1=OK
2=Cancel
1001=Chinese (simplified)
2459=The current file is an old version format file. Please specify the language used for the characters in the file

[IDD_SET_LAY]
CAPTION=Layer setup
1=OK
2=Cancel
2461=Move Selected Part to Section
2464=storey
1543=
2462=Move the selected fill line part of the layer to the
2465=storey
1544=
2463=Move the selected indented contour section to the
2466=storey
1545=

[IDD_SET_PDF4172D]
CAPTION=PDF417 two-dimensional barcode setup
1=OK
2=Cancel
1027=Rows of barcodes:
1495=
2472=Determine the following parameters based on barcode guidelines:
2458=Error Level
1030=
2204 =(3~~90 or 0)


[IDD_SET_QR2D]
CAPTION=QR barcode setup
1=OK
2=Cancel
1605=
2450=Barcode size:
2474=Error correction level:
1604=
2473=Determine the following parameters based on barcode guidelines:
2475=Encoding mode:
1952=IDD_SET_QR2D_COMBOBOX_2


[IDD_SET_RECTANGLE]
CAPTION=Rectangle Set
1589=Normal
1590=Fillet
1591=Chamfer
1592=
1=OK
2=Cancel
2476=Rounding radius/chamfer size (mm)
2192=Degree of rounding
2184=All corners rounded

[IDD_SET_RUN]
CAPTION=Motion Setup
1=Ok
2=Cancel
2477=Axis number:
1864=
1867=Absolute Motion
1394=Relative Motion
2478=Sports mode
2321=Rotational motion (degrees)
2320=Linear motion (mm)
1502=
1866=
2479=Motion type
1543=Work Motion
1544=Empty Motion
1545=Home

[IDD_SET_TRACKER]
CAPTION=Set tracker properties
1004=Dashed line
1003=Solid line
1009=Not have
1007=Within the contour line
1008=Outside the contour line
104=
1=OK
2=Cancel
2483=Control point size:
2481=Contour line
2482=Control point


[IDD_SET_USERDEFINE]
CAPTION=UserDef BarCode setup
1=OK
2=Cancel
2012=ROW:
2013=COL:
2014=
2015=
2016=Description:User defined barcode, user can customize the number of rows and columns (default is 16x16), support processing of binary, decimal, and hexadecimal input data, input binary numbers can only contain "01" ("0" - white, "1" - black), decimal numbers need to be separated by "," hexadecimal numbers need to contain "0x", the first 8 digits of binary numbers, the first two digits of decimal numbers, and the first two digits of hexadecimal numbers correspond to the QR code from top to bottom The first 8 barcode blocks numbered from left to right, and so on, can represent the content of all barcode blocks.

[IDD_STYLE_SAVE]
CAPTION=Save scheme
1187=
1=OK
2=Cancel
2484=Parameter scheme save as:



[IDD_TEXT_PAGE_TEXT]
CAPTION=
1628=
2172=
2151=OK
1504=Fixed part
1623=Serial
1624=Date&Time
1625=Serial comm
1629=Network comm
1343=Set...
1627=
1626=
1635=
2156=Fixed part
2157=Serial
2160=Serial communication
2158=Data&Time
2159=Network communication
182=Serial text
183=Network text
2146=
2147=
2148=
2149=
2150=
2161=Port:
2162=Baud rate:
2163=Data bits:
2164=Stop bits:
2165=Parity check:
2166=Command:
2152=
2153=
2167=IP:
2168=Port:
2155=Parameter
2170=Unicode
2171=Overtime:
2173=ms
2174=Communication set

[IDD_BARCODE_DLG]
CAPTION=Barcode setup
1=OK
2=Cancel
1030=
2188=Barcode type
1622=Tab1
1398=Set...
2156 = BarCodeType

[IDD_DlgCustomAutoSortGrpList]
CAPTION=Auto Sort 2
2394=Sorting method:
2063=
2064=Sort only selected objects
2065=
2393=Block height (mm):
2066=
3=Perform Sorting
4=Exit

[IDD_DIALOG_EXTENDFUNCTION_INFO]
CAPTION=Extend Function Information
1=Save && Exit(&C)
1034=
2233=Card number：
1502=
2211=Alias：
1911=
1912=modification


[IDD_DIALOG_OBJINFO_MOTORMOVE]
CAPTION=
2247=Axis number:
1864=
1867=Absolute Motion
1394=Relative Motion
2318=Sports mode
2321=Rotational motion (degrees)
2320=Linear motion (mm)
1502=
1866=
2319=Motion type
1543=Work Motion
1544=Empty Motion
1545=Home
65535=Move Type

[IDD_DIALOG_3DLOAD]
CAPTION=Make 3D Model
1913=Base
1394=STL.STP.DXF or IGES
1914=IDD_DIALOG_3DLOAD_COMBOBOX_0
1502=
1912=...
1918=
1159=
1919=
1160=
1922=
1923=
1941=Add
1672=Delete
1414=Modify
1911=
1943=Round Y axis
2501=Round X axis
1196=
1915=
1197=
1948=Upright
1916=
1947=
1034=
1=Ok
2=Cancel
1924=Parameter
1926=Position 0
1927=x
1928=y
1930=Position 1
1931=x
1932=y
1929=z
1933=z
1940=Step
1925=Incline
1934=Sphere/Taper
1935=Radius
1936=Length
1939=Radius1
1942=Width
1944=New
1938=Column
1945=Start Angle
1946=End Angle
1950=Tip:The angle range is 0 to 180. When the cone is placed vertically, it is 0-360. The starting angle must be greater than the stopping angle
1549=Auto to Center
2069=
2175 = Type
2176 = File
2209 = Shape
1949=Type

[IDD_MARK_MULDOC]
CAPTION=Multi-document mark
1013=Start(M)
1014=Abort
2=Exit
1383=
1384=Move up
1385=Move down
1276=Delete
1220=Property...
1258=Save...
1492=Mark
1634=Red light preview
1543=Frame preview
1012=
1407=Keyboard, mouse or foot-pedal trigger
2202=Interval Time(ms):
1462=
1463=
1464=
1793=Loop Mark
1502=
1903=Motor Home
2197 = Multiple Document Settings
1413 = Number of markings:
2199 = Single Time:
2200 = Total Time:
2201 = WorkMode


[IDD_TEXT_PAGE]
CAPTION=
1034=
1398=Add
1403=Delete
1621=Modify
1622=Tab1
2379=Text content

[IDD_TEXT_BASEDLG]
CAPTION=Text barcode setup
1=OK
2=Cancel
1620=Tab1
1414 = Apply

[IDD_TEXT_SERIAL]
CAPTION=Serial setup
1193=
1002=
1012=
1199=
1215=
1220=Set...
1239=Custom
1240=Obtained from files (Each Line)
1241=Obtained from files (First Line)
1268=
1269=
1270=Fill in bits
1=OK
2=Cancel
1358=
1502=
1216=
1217=
1499=Set Count
1649=Jump Loop
2074=
2051=Sel...
1363=Starting point
1364=End point
2497=Fill in pre-positioned character
2496=Total length of serial part
1940=Step length
2494=Pre-position
2495=After-position
2499=Numeration system content
2213=Interval:
2493=Current Mark Count


[IDR_POP]
IDR_POP_SUBMENU_0= Normal
IDR_POP_SUBMENU_1=Serial
IDR_POP_SUBMENU_2=Barcode
IDR_POP_SUBMENU_3=Bitmap
IDR_POP_SUBMENU_4=Text
IDR_POP_SUBMENU_5=Layer
IDR_POP_SUBMENU_6=ObjectList
IDR_POP_SUBMENU_7=ObjectEdite
IDR_POP_SUBMENU_8=UserManage
IDR_POP_SUBMENU_9=Spline
IDR_POP_SUBMENU_10=Arc
IDR_POP_SUBMENU_11=Circle

[IDR_POP_SUBMENU_0]
32975=Layer setup(&Y)
0=----------------------
32901=Center(&M)	Ctrl+M
32907=X mirror(&X)
32908=Y mirror(&Y)
32913=Rotate 90 degrees counter-clockwise(&L)
32914=Rotate 90 degrees clockwise(&R)
0=----------------------
33016=Move Dot(&M)
0=----------------------
57635=Cut(&T)	Ctrl+X
57634=Copy(&C)	Ctrl+C
32791=Delete(&D)	Del
57637=Paste(&P)	Ctrl+V
0=----------------------
33011=Convert To line(&F)
33040=Add To Single Object
0=----------------------
57642=Select all(&A)	Ctrl+A

[IDR_POP_SUBMENU_1]
32975=Layer setup(&Y)
0=----------------------
32936=Serial setup(&S)
0=----------------------
32901=Center(&M)	Ctrl+M
32907=X mirror(&X)
32908=Y mirror(&Y)
32913=Rotate 90 degrees counter-clockwise(&L)
32914=Rotate 90 degrees clockwise(&R)
0=----------------------
33016=Move Dot(&M)
0=----------------------
57635=Cut(&T)	Ctrl+X
57634=Copy(&C)	Ctrl+C
32791=Delete(&D)	Del
57637=Paste(&P)	Ctrl+V
0=----------------------
33011=Convert To line(&F)
0=----------------------
57642=Select all(&A)	Ctrl+A

[IDR_POP_SUBMENU_2]
32975=Layer setup(&Y)
0=----------------------
32936=Barcode text setup(&S)
32998=New barcode text(&H)
0=----------------------
32901=Center(&M)	Ctrl+M
32907=X mirror(&X)
32908=Y mirror(&Y)
32913=Rotate 90 degrees counter-clockwise(&L)
32914=Rotate 90 degrees clockwise(&R)
0=----------------------
33016=Move Dot(&M)
0=----------------------
57635=Cut(&T)	Ctrl+X
57634=Copy(&C)	Ctrl+C
32791=Delete(&D)	Del
57637=Paste(&P)	Ctrl+V
0=----------------------
57642=Select all(&A)	Ctrl+A

[IDR_POP_SUBMENU_3]
32975=Layer setup(&Y)
0=----------------------
32954=Bitmap setup(&S)
33140=Bitmap Intensity
0=----------------------
32901=Center(&M)	Ctrl+M
32907=X mirror(&X)
32908=Y mirror(&Y)
32913=Rotate 90 degrees counter-clockwise(&L)
32914=Rotate 90 degrees clockwise(&R)
0=----------------------
33016=Move Dot(&M)
0=----------------------
57635=Cut(&T)	Ctrl+X
57634=Copy(&C)	Ctrl+C
32791=Delete(&D)	Del
57637=Paste(&P)	Ctrl+V
0=----------------------
57642=Select all(&A)	Ctrl+A

[IDR_POP_SUBMENU_4]
32975=Layer setup(&Y)
0=----------------------
32936=Text setup(&S)
0=----------------------
32901=Center(&M)	Ctrl+M
32907=X mirror(&X)
32908=Y mirror(&Y)
32913=Rotate 90 degrees counter-clockwise(&L)
32914=Rotate 90 degrees clockwise(&R)
0=----------------------
33016=Move Dot(&M)
0=----------------------
57635=Cut(&T)	Ctrl+X
57634=Copy(&C)	Ctrl+C
32791=Delete(&D)	Del
57637=Paste(&P)	Ctrl+V
0=----------------------
33011=Convert To line(&F)
0=----------------------
57642=Select all(&A)	Ctrl+A

[IDR_POP_SUBMENU_5]
33012=Modify Color
33021=Lock Layer
33022=Unlock Layer
33083=Select layer
33084=Unselect layer

[IDR_POP_SUBMENU_6]
33013=Delete Object
33041=Load Object List
33088=Move Prev
33089=Move Next
33090=Move First
33091=Move Last
33143=ReName

[IDR_POP_SUBMENU_7]
33014=Delete Sel Dot(&D)
33015=Line join&C)
33016=Move Dot(&M)
0=----------------------
33018=Kill Dot(&X)
33024=Filter Dot(&F)
33028=Kill Angle(&V)
0=----------------------
33020=Select All Line(&A)
33023=Set Dot to Begin(&S)
33025=Line Reverse(&R)
0=----------------------
33151=Edit coordinate(&E)

[IDR_POP_SUBMENU_8]
33055=Add User
33056=Delete User
33057=Modify User Name
33058=Modify Password

[IDR_POP_SUBMENU_9]
32975=Layer setup(&Y)
0=----------------------
33102=Spline edit
33122=Precision set
0=----------------------
32901=Center(&M)	Ctrl+M
32907=X mirror(&X)
32908=Y mirror(&Y)
32913=Rotate 90 degrees counter-clockwise(&L)
32914=Rotate 90 degrees clockwise(&R)
0=----------------------
33016=Move Dot(&M)
0=----------------------
57635=Cut(&T)	Ctrl+X
57634=Copy(&C)	Ctrl+C
32791=Delete(&D)	Del
57637=Paste(&P)	Ctrl+V
0=----------------------
33011=Convert To line(&F)
33040=Add To Single Object
0=----------------------
57642=Select all(&A)	Ctrl+A

[IDR_POP_SUBMENU_10]
32975=Layer setup(&Y)
0=----------------------
33119=Arc edit
33122=Precision set
0=----------------------
32901=Center(&M)	Ctrl+M
32907=X mirror(&X)
32908=Y mirror(&Y)
32913=Rotate 90 degrees counter-clockwise(&L)
32914=Rotate 90 degrees clockwise(&R)
33016=Move Dot(&M)
0=----------------------
57635=Cut(&T)	Ctrl+X
57634=Copy(&C)	Ctrl+C
32791=Delete(&D)	Del
57637=Paste(&P)	Ctrl+V
0=----------------------
33011=Convert To line(&F)
33040=Add To Single Object
0=----------------------
57642=Select all(&A)	Ctrl+A

[IDR_POP_SUBMENU_11]
32975=Layer setup(&Y)
0=----------------------
33121=Circle set
33122=Precision set
0=----------------------
32901=Center(&M)	Ctrl+M
32907=X mirror(&X)
32908=Y mirror(&Y)
32913=Rotate 90 degrees counter-clockwise(&L)
32914=Rotate 90 degrees clockwise(&R)
0=----------------------
33016=Move Dot(&M)
0=----------------------
57635=Cut(&T)	Ctrl+X
57634=Copy(&C)	Ctrl+C
32791=Delete(&D)	Del
57637=Paste(&P)	Ctrl+V
0=----------------------
33011=Convert To line(&F)
33040=Add To Single Object
0=----------------------
57642=Select all(&A)	Ctrl+A

[IDR_EDITFRAME]
IDR_EDITFRAME_SUBMENU_0=File(&F)
IDR_EDITFRAME_SUBMENU_1=View(&V)
IDR_EDITFRAME_SUBMENU_2=Setup(&S)
IDR_EDITFRAME_SUBMENU_3=Help(&H)

[IDR_EDITFRAME_SUBMENU_0]
57600=New(&N)	Ctrl+N
57601=Open(&O)...	Ctrl+O
32953=Open multiple files(&M)...
0=----------------------
57606=Print setup(&R)...
57616=Most recently used file
57665=Exit(&X)

[IDR_EDITFRAME_SUBMENU_1]
106=Property(&P)
59393=Status bar(&S)
IDR_EDITFRAME_SUBMENU_1_0 = Toolbar(&T)

[IDR_EDITFRAME_SUBMENU_2]
32841=Hardware configuration(&H)...

[IDR_EDITFRAME_SUBMENU_3]
57664=Ahout HBM(&A)

[IDR_HETYPE]
IDR_HETYPE_SUBMENU_0=File(&F)
IDR_HETYPE_SUBMENU_1=Edit(&E)
IDR_HETYPE_SUBMENU_2=Draw(&D)
IDR_HETYPE_SUBMENU_3=Modify(&A)
IDR_HETYPE_SUBMENU_4=Tool(&T)
IDR_HETYPE_SUBMENU_5=View(&V)
IDR_HETYPE_SUBMENU_6=Setup(&S)
IDR_HETYPE_SUBMENU_7=Window(&W)
IDR_HETYPE_SUBMENU_8=Help(&H)
IDR_HETYPE_SUBMENU_9=

[IDR_HETYPE_SUBMENU_0]
57600=New(&N)	Ctrl+N
57601=Open(&O)...	Ctrl+O
57602=Close(&C)
57603=Save(&S)	Ctrl+S
57604=Save as(&A)...
0=----------------------
306=Import(&I)...
33156=Import a G Code file(*.NC)
57607=Print(&P)...	Ctrl+P
57606=Print setup(&R)...
57616=Most recently used file
57665=Exit(&X)

[IDR_HETYPE_SUBMENU_1]
57643=Undo(&U)	Ctrl+Z
57644=Redo(&R)	Ctrl+Y
0=----------------------
57635=Cut(&T)	Ctrl+X
57634=Copy(&C)	Ctrl+C
57637=Paste(&P)	Ctrl+V
32791=Delete(&D)	Del
57642=Select all(&A)	Ctrl+A
32828=Combine(&G)	Ctrl+G
32829=UnCombine(&U)	Ctrl+U
33131=Group(&G)	Ctrl+G
33132=Ungroup(&U)	Ctrl+U
33011=Convert to Line
33414=Convert Vector to Bitmap
33413=Convert to Swing Line
33235=Convert Excel To TXT
33229=Batch Replace Text
32832=Option(&O)...

[IDR_HETYPE_SUBMENU_2]
32821=Click(&C)
0=----------------------
307=Hand draw(&H)
33097=Spline
32813=Rectangle(&R)
32814=Ellipse(&E)
33113=Arc1
33115=Arc2
33117=Circle
32815=Polygon(&P)
32816=Grid(&G)
33129=Point(&D)
33244=Sprial
308=Text Serial(T)
32919=Barcode(&B)
33092=Delay(&D)
33093=Input(&I)
33094=Output(&O)
33138=Motion Control(&M)
33139=Motor Positon(&S)
33141=Condition(&C)
33189=Laser Control
33198=CCD
33200=Position Cali
32820=Hatch(&F)

[IDR_HETYPE_SUBMENU_3]
32940=Array Arrangement(&A)...
0=----------------------
33399=Transform Object
33409=Plastic
33027=Point Filter(&F)	Ctrl+F
IDR_HETYPE_SUBMENU_3_0=Transform(&C)
IDR_HETYPE_SUBMENU_3_1=Sort
IDR_HETYPE_SUBMENU_3_2=Curve Edit

[IDR_HETYPE_SUBMENU_4]
33162=Locate Focus
33220=Split Text Object
33136=Auto Group Objects
33184=Assistant Point
33142=Ruler Tool
33224=Measure Distance
33225=Measure Angle

[IDR_HETYPE_SUBMENU_5]
59393=Tracker setup(&r)...
0=----------------------
33008=Object List Dialog
33009=Property Dialog
IDR_HETYPE_SUBMENU_5_0=Toolbar(&T)
IDR_HETYPE_SUBMENU_5_1=Zoom(&Z)

[IDR_HETYPE_SUBMENU_6]
0=----------------------
33053=Shortcut Key Bind(&K)
33085=User Font(&F)
33001=Gray Current Compensate(&G)...
33002=Gray NonLinear Compensate(&P)
33414=Convert Vector to Bitmap Set
33054=Rights Manager(&R)
33059=Change User(&X)
33130=Log Off(&L)
33425 =Language

[IDR_HETYPE_SUBMENU_7]
57648=New window(&N)
57650=Cascade(&C)
57651=Tile horizontally(&T)
57649=Arrange(&A)

[IDR_HETYPE_SUBMENU_8]
57664=About HBM/HE(&A)
IDR_HETYPE_SUBMENU_8_0=Help(&H)

[IDR_HETYPE_SUBMENU_5_0]
32804=Zoom out(&O)
32805=Zoom in(&I)
32807=All objects(&A)
32808=Selected object(&S)
32809=Non-proportional zoom(&R)
59392=Common(&M)
131=Draw(&D)
130=Change(&C)
132=Zoom(&S)

[IDR_HETYPE_SUBMENU_5_1]
32804=Zoom out(&O)
32805=Zoom in(&I)
32807=All objects(&A)
32808=Selected object(&S)
32809=Non-proportional zoom(&R)

[IDR_HETYPE_SUBMENU_6_0]
33175=English
33176=Simplified Chinese
33177=Traditional Chinese

[IDR_HETYPE_SUBMENU_8_0]
33193=Chinese
33194=English

[IDR_HETYPE_SUBMENU_3_0]
32901=Center(&M)	Ctrl+M
0=----------------------
32913=Rotate 90 Degrees Counter-Clockwise(&L)
32914=Rotate 90 Degrees Clockwise(&R)
32907=X Mirror(&X)
32908=Y Mirror(&Y)
33040=Convert to One Object(&U)	Alt+U

[IDR_HETYPE_SUBMENU_3_1]
33029=Manual Sort(&M)	Alt+M
33030=Auto Sort(&A)	Alt+A
33068=Select Sort(&S)	Alt+S
33246=Auto Sort 2
33245=SortObjbyLay
33079=Path Optimization
33080=Reset Sort

[IDR_HETYPE_SUBMENU_3_2]
33076=Auto Connect
33182=Break Cross Point
33241=Remove Overlap Line
33205=Broaden

[IDR_EDITFRAME_SUBMENU_1_0]
59392=Common(&C)
131=Draw(&D)
130=Change(&g)
132=Zoom(&S)

[IDR_MAINFRAME]
IDR_MAINFRAME_SUBMENU_0=File(&F)
IDR_MAINFRAME_SUBMENU_1=View(&V)
IDR_MAINFRAME_SUBMENU_2=Setup(&S)
IDR_MAINFRAME_SUBMENU_3=Help(&H)

[IDR_MAINFRAME_SUBMENU_0]
57600=New(&N)	Ctrl+N
57601=Open(&O)...	Ctrl+O
32953=Open multiple files(&M)...
0=----------------------
57606=Print setup(&R)...
57616=Most recently used file
57665=Exit(&X)

[IDR_MAINFRAME_SUBMENU_1]
IDR_MAINFRAME_SUBMENU_1_0=Toolbar(&T)
106=Property(&P)
59393=Status bar(&S)
33008=Object List Dialog
33009=Property Dialog

[IDR_MAINFRAME_SUBMENU_1_0]
59392=Common(&C)
131=Draw(&D)
130=Change(&g)
132=Zoom(&S)

[IDR_MAINFRAME_SUBMENU_2]
32841=Hardware configuration(&H)...

[IDR_MAINFRAME_SUBMENU_3]
57664=Ahout HBM(&A)
33218=EMCC run information

[IDD_DIALOG_TESTFOCUS]
CAPTION=Microfocal positioning
1=Apply(&A)
2=Exit(&C)
1502=0.05
1911=10
1013=Mark(&M)
1014=Stop(&S)
2189=Step 1: Set the focus adjustment amount and mark it
2190=Step 2: Find the most effective one and enter the number into the edit box
2191 = Fine adjustment amount
2193 =Best Marking Effect Number:

[IDD_MARK_WHEEL2]
CAPTION=Move Mark
1870=Mark Statistics
1475=0
1265=0:00:00:00
1263=0
1266=0:00:00:00
1264=0: 0: 0: 0.000
1267=0:00:00:00
1492=Mark
1634=Red Preview
1012=
1396=Refresh
1794=
1724=Red
1013=Start(&M)
1014=Stop(&E)
2=Exit(&X)
1740=Loop Mark
1502=100
1034=
1803=
1804=
1869=Home after mark end
1903=Motor Home
2422=Total number of markings:
1475=0
2423=Total time:
1413=Number of markings:
1263=0
2436=Free time:
2405=Single time:
1414=Marking time:
1267=0:00:00:00
2444=Marking type

[IDD_MARK_DIALOG_COMBOBOX_0]
0=Whole Preview
1=Objs Preview
2=Outline Preview

[IDD_TEXTEDIT_DLG_COMBOBOX_0]
0=Fix text
1=Serial
2=Time
3=Serial text
4=Network text

[IDD_TEXTEDIT_DLG_COMBOBOX_1]
0=TTF font
1=SHX font
2=Custom font
3=Dot matrix font
4=Fnt font

[IDD_DIALOG_3DLOAD_COMBOBOX_0]
0=Step
1=Incline
2=Column
3=Sphere
4=Taper

[IDD_DIALOG_BAREDIT_COMBOBOX_1]
0=Fix text
1=Serial
2=Time
3=Serial text
4=Network text

[IDD_DIALOG_OBJINFO_CCD_COMBOBOX_0]
0=Continue
1=Exit

[IDD_BAR_PAGE_COMBOBOX_0]
0=MAC - 罗马
1=MAC - 日语
2=MAC - 繁体中文 Big5
3=MAC - 朝鲜语
4=MAC - 阿拉伯语
5=MAC - 希伯来语
6=MAC - 希腊语 I
7=MAC - 西里尔文
8=MAC - 简体中文 GB 2312
9=MAC - 罗马尼亚
10=MAC - 乌克兰
11=MAC - 泰语
12=MAC - 拉丁语 II
13=MAC - 冰岛文
14=MAC - 土耳其语
15=MAC - 克罗地亚
16=IBM EBCDIC - 土耳其语(拉丁语-5
17=IBM EBCDIC - 拉丁语-1/开放系统
18=IBM EBCDIC - 美国/加拿大(37 + Euro
19=IBM EBCDIC - 德国(20273 + Euro
20=IBM EBCDIC - 丹麦/挪威(20277 + Euro
21=IBM EBCDIC - 芬兰/瑞典(20278 + Euro
22=IBM EBCDIC - 意大利(20280 + Euro
23=IBM EBCDIC - 拉丁美洲/西班牙(20284 + Euro
24=IBM EBCDIC - 英国 (20285 + Euro
25=IBM EBCDIC - 国际(500 + Euro
26=IBM EBCDIC - 冰岛语(20871 + Euro
27=ANSI - 中欧
28=ANSI - 西里尔文
29=ANSI - 拉丁语 I
30=ANSI - 希腊语
31=ANSI - 土耳其语
32=ANSI - 希伯来语
33=ANSI - 阿拉伯语
34=ANSI - 波罗的海
35=ANSI/OEM - 越南
36=朝鲜语 - Johab
37=CNS - 台湾
38=TCA - 台湾
39=Eten - 台湾
40=IBM5550 - 台湾
41=TeleText - 台湾
42=Wang - 台湾
43=IA5 IRV 国际字母表 5
44=IA5 德语
45=IA5 瑞典语
46=IA5 挪威语
47=US-ASCII
48=T.61
49=ISO 6937 无空格重音符
50=IBM EBCDIC - 德国
51=IBM EBCDIC - 丹麦/挪威
52=IBM EBCDIC - 芬兰/瑞典
53=IBM EBCDIC - 意大利
54=IBM EBCDIC - 拉丁美洲/西班牙
55=IBM EBCDIC - 英国
56=IBM EBCDIC - 扩展式日语片假名
57=IBM EBCDIC - 法国
58=IBM EBCDIC - 阿拉伯语
59=IBM EBCDIC - 希腊语
60=IBM EBCDIC - 希伯来语
61=IBM EBCDIC - 扩展式朝鲜语
62=IBM EBCDIC - 泰语
63=俄语 - KOI8
64=IBM EBCDIC - 冰岛语
65=IBM EBCDIC - 西里尔文(俄语
66=IBM EBCDIC - 土耳其语
67=IBM EBCDIC - 拉丁语-1/开放系统(1047 + Euro
68=JIS X 0208-1990  0212-1990
69=简体中文 GB2312
70=IBM EBCDIC - 西里尔文(塞尔维亚语、保加利亚语
71=Ext Alpha 小写
72=乌克兰语 - KOI8-U
73=ISO 8859-1 拉丁语 I
74=ISO 8859-2 中欧
75=ISO 8859-3 拉丁语 3
76=ISO 8859-4 波罗的语
77=ISO 8859-5 西里尔文
78=ISO 8859-6 阿拉伯语
79=ISO 8859-7 希腊语
80=ISO 8859-8 希伯来语: 视觉排序
81=ISO 8859-9 拉丁语 5
82=ISO 8859-13 拉丁语 7
83=ISO 8859-15 拉丁语 9
84=IBM EBCDIC - 美国/加拿大
85=ISO 8859-8 希伯来语: 逻辑排序
86=OEM - 美国
87=IBM EBCDIC - 国际
88=ISO-2022 不带半形片假名的日语
89=ISO-2022 带半形片假名的日语
90=ISO-2022 日语 JIS X 0201-1989
91=ISO-2022 朝鲜语
92=ISO-2022 简体中文
93=ISO-2022 繁体中文
94=EUC-朝鲜语
95=HZ-GB2312 简体中文
96=GB18030 简体中文
97=SMS GSM 7bit
98=SMS GSM 7bit 西班牙语
99=SMS GSM 7bit 葡萄牙语
100=SMS GSM 7bit 土耳其语
101=SMS GSM 7bit 希腊语
102=ISCII - 梵文
103=ISCII - 孟加拉语
104=ISCII - 泰米尔语
105=ISCII - 泰卢固语
106=ISCII - 阿萨姆语
107=ISCII - 奥里亚语
108=ISCII - 埃纳德语
109=ISCII - 马拉雅拉姆语
110=ISCII - 古吉拉特语
111=ISCII - 旁遮普语(果鲁穆奇语
112=阿拉伯语 - ASMO
113=阿拉伯语 - 透明 ASMO
114=OEM - 希腊语 437G
115=OEM - 波罗的语
116=OEM - 多语言拉丁语 I
117=OEM - 拉丁语 II
118=OEM - 西里尔文
119=OEM - 土耳其语
120=OEM - 多语言拉丁语 I + Euro
121=OEM - 葡萄牙语
122=OEM - 冰岛语
123=OEM - 希伯来语
124=OEM - 加拿大法语
125=OEM - 阿拉伯语
126=OEM - 挪威语
127=OEM - 俄语
128=OEM - 现代希腊语
129=IBM EBCDIC - 多语言/ROECE (拉丁语-2
130=ANSI/OEM - 泰语
131=IBM EBCDIC - 现代希腊语
132=ANSI/OEM - 日语 Shift-JIS
133=ANSI/OEM - 简体中文 GBK
134=ANSI/OEM - 朝鲜语
135=ANSI/OEM - 繁体中文 Big5
136=UTF-7
137=UTF-8

[IDD_BAR_PAGE_COMBOBOX_1]
0=1 by 1,from IN to OUT
1=1 by 1,from OUT to IN
2=Traverse,from IN to OUT
3=Traverse,from OUT to IN

[IDD_TEXT_PAGE_FNT_COMBOBOX_6]
0=TTF font
1=SHX font
2=User font
3=Matrix font
4=Fnt font

[IDD_SET_QR2D_COMBOBOX_2]
0=Number
1=Alphanumeric
2=8-bit byte
3=KANJI
4=GB2312
5=MixCode
6=GS1

[STRINGTABLE]
241 = Failed to import EZD document
240 = All corner triangles
239 = All corners rounded
238 = degree of chamfer ( mm )
237 = Roundness ( 0 ~ 100 )
236 = Rectangle
235 = Lmc1_Initial Initialization failed
234 = Loading MarkEzdDll failed .dll
233=Choosing None requires restarting the software to take effect
232=Are you sure you want to delete this shortcut key?
230=Red light (F1)
229=file %s not found
228=function
227=Hot key
231=stop red light (F1)
223=Length:
226=Angle:
32779=Initialize laser marker to the normal marking status|Normal mark
57642=|Select all objects
57643=Cancel the latest operation|Undo
57644=Re-execute a cancelled operation|Redo
57648=Open a new window for an active file|New window
57649=Arrange icons at the bottom of window|Arrange icons
57650=Arrange all view windows in an overlapped pile|Cascade windows
57651=Arrange all veiw windows side by side|Tile windows
57652=Arrange all veiw windows side by side|Tile widows
57653=Split an active window into panes|Split
57664=Display program information, version and copyright|About
57665=Exit the application, prompt to save file |Exit
57666=Open help|Help subject
57667=List help subjects|Help subject
57668=Display instructions relating to how to use the help function|Help
57669=Display help information relating to buttons, menus and windows|Help
57670=Display help information relating to current task or command|Help
57680=Switch to the next pane|Next pane
57681=Switch to the previous pane|Previous pane
59392=Show or hide the commonly used toolbar|Show/Hide toolbar
59393=Show or hide status bar|Show/Hide status bar
59415=Dot
61184=Resize a window
61185=Move a window
61186=Minimize a window into an icon
61187=Maximize a window
61188=Switch to the next document window
61189=Switch to the previous document window
61190=Close all active windows and prompt to save all files
61202=Restore a window to its normal size
61203=Activate a task list
61215=Activate a window
61445=Close the print preview mode|Cancel preview
61449=not selecte edite point!
61450=Have repeat point!
61451=select one dot only!
61452=the line is not closed!
61453=two distance is too short ,can not connect!
61454=filter cmd
61455=extend Cmd
61456=Are you sure sort the object list?
61458=Are you sure exit sort proccesing?
61459=Are you sure set current point as start point?
61460=The object does not line!
61461=Object group
61462=select Group
61463=object align
61464=The number of sortted objects can not less 6!
61465=General
61466=Advance
61472=No
61473=Layer
61474=Fram
61475=Fill
61476=Fill First
61477=Offline status, Data download again?
61478=Offline status, Turn to online status?
61479=Start
61480=Stop
61481=Are you sure clear downloaded data?
61482=Speed
61483=Q
61484=Q Rls
61485=Are you sure exit current program and start calibrate?
61486=Are you sure exit current program  and start Lasr-parameter setting?
61487=Are you sure Joint strokes?
61488=Abs Pos:
61489=Rel Pos:
61490=Are you sure make path optimization?
61491=Are you sure restore normal path?
61492=Are you sure exit current program  and start M-adjust Program?
61493=Download successfully! The %d%% memory space of board was used! Offline marking enabled.
61494=Software was damaged!
61495=Fix text
61496=Serial
61497=Time
61498=TTF font
61499=SHX font
61500=User font
61501=Spline
61502=The spline is closed?
61503=Arc
61504=Circle
61505=Invalid input!
61506=The value of jump setting error!
61507=Arc
61508=Circle
61509=Path Optimize
61510=Stop(&E)
61511=Matrix font
61512=Union
61513=Motor move   
61514=Motor pos   
61515=Can't find the calibrate file,please calibrate first!
61516=System will regroup the objects!
61517=AutoSegment
61518=Warnning! Object exceed width limit!
61519=System can't do this operation, please sure there have no function object!
61520=User
61521=Type
61522=Gray
61523=Count
61524=System will recompose the data!
61525=Object
61526=Interval
61527=Visible
61528=Decimal
61529=Priority
61530=Union
61531=Ununion
61532=ChangeLayer
61533=No connection card
61534=Software dog does not have a multi - card function
61535=The software dog ID is inconsistent with the dog ID on the card
61536=The card ID on the card is empty or of the wrong length
61537=Please log in to the WeChat public account "Han's Laser Fiber Marking" -> "Employee Channel" -> "More Services" -> "Authorized Document Management Center" -> "Encrypted File Application", and download the license file as prompted.
61538=Copy the successfully downloaded license file to the %%s directory.
61539=Note: If the application fails, please contact Han's after-sales service personnel.
61540=Open DogInfoReader.exe,check usb dog?
61541=Failed to fill! Contains unclosed strokes!
61542=Failed to fill! Contains small redundant line segments!
61543=Fast marking in progress. apply failed!
61544=Red preview in progress. apply failed!
61545=Object marking in progress. apply failed!
61546=Fnt font
61547=No marking object!
61548=1 by 1,from IN to OUT
61549=1 by 1,from OUT to IN
61550=Traverse,from IN to OUT
61551=Traverse,from OUT to IN
61552=The object cannot be filled.
61553=The barcode object has been automatically filled, and external filling cannot be used.
61554=Object Operate
61555=Position
61556=Angle
61557=Mirror
61558=Size
61559=Shear
61560=Center
61561=mm
61562=Scale
61563=°
61564=Draw other graphics
61565=3D View
61567=The current processing number is greater than the total number of processing, please reset the current processing number before processing!
33148=3D/2D Switch|3D/2D Switch
33149=Load 3D model|Load 3D model
33150=Transform 3D Model|Transform 3D Model
33151=Edit coordinate of selected dots |Edit coordinate of selected dots
33154=Import a vector file|Import a vector file
33155=Import a image|Import a image
33156=Import a G Code file(*.NC)|Import a G Code file(*.NC)
33157=Top view|Top view
33158=Left view|Left view
33159=Front view|Front view
33160=Trimetric view|Trimetric view
33162=Locate focus|Locate focus
33163=Set rotate wheel para|Set rotate wheel para
33165=Motion set|Motion set
33178=Weld|Weld
33182=Filter point of intersection|InterFilter
33184=Assistant point|Assistant Points
33189=Create Laser Control Object| Laser Control 
33198=CCD object| CCD
33200=Pos cali| Pos cali
33202=Move 3D model|Move 3D model
33205=Broaden Stroke|Broaden Stroke
33211=Enter move marking|Enter move marking
33220=Split text object|split text object
33224=Measure Distance|Measure Distance
33225=Measure Angle|Measure Angle
33226=Intersect|Intersect
33227=Trim|Trim
33228=Remove|Remove
33245=SortObjbyLay|SortObjbyLay
33246=Auto Sort2|Auto Sort2
33247=Center selected model|Center selected model
33256=Fly Mark Setting
33264=|Invert selection object
33266=|Lock Object
33267=|UnLock Object
33268=|UnLock All Object
33270=|Select objects by pen number
33273=|Display
33274=|UnDisplay
33275=|Object Operate
33399=|ObjTransform
33413=|Covert to swing line
33415=Conversion to bitmap|Conversion to bitmap
57344=HL
57345=        
57346=Select and Bind Shortcut Key
57347=%1 在 %2 中
57349=%1 - %2
57600=Create a new file|New
57601=Open an existing file|Open
57602=Close an active file|Close
57603=Save an active file|Save
57604=Save an active file with a new name|Save as
57605=Change Print Option|Page Set
57606=Change printer and print options|Print setup
57607=Print an active file|Print
57609=Preview All Page|Preview All Page
57616=Open the file
57617=Open the file
57618=Open the file
57619=Open the file
57620=Open the file
57621=Open the file
57622=Open the file
57623=Open the file
57624=Open the file
57625=Open the file
57626=Open the file
57627=Open the file
57628=Open the file
57629=Open the file
57630=Open the file
57631=Open the file
57632=Delete a selected object|Delete
57633=Delete all objects|Delete all
57634=Copy a selected object and put it onto the clipboard|Copy
57635=Cut a selected object and put it onto the clipboard|Cut
57636=Find the designated content|Find
57637=Insert the contents on clipboard|Paste
57640=Repeat the previous operation|Repeat
57641=Replace the designated content with a different content|Replace

33005=Drag View|Drag view
33006=Zoom Off a drawing|Zoom Off
33007=Node Edit|Node Edit
33008=Object List Display Dialog|Object List Display Dialog
33009=Property Display Dialog|Property Display Dialog
33010=Node Move|Node Move
33011=Convert To line| Convert To line
33014=Delete Sel Dot| Delete Sel Dot
33015=Line join| Line join
33016=Move Dot| Move Dot
33017=Break Operate |Break Operate   
33018=Kill Dot| Kill Dot
33029=manual sort|manual sort
33030=Auto Sort|Auto Sort
33039=Go Line Sort|Go Line Sort
33040=Convert all object to one object|Convert to one object
33044=Equal Width|Equal Width
33045=Equal Height|Equal Height
33046=Equal Size|Equal Size
33047=Align Left|Align Left
33048=Align Right|Align Right
33049=Align Top|Align Top
33050=Align Bottom|Align Bottom
33051=Equal Distance X|Equal Distance X
33052=Equal Distance Y|Equal Distance Y
33053=Shortcut Key Bind| Shortcut Key Bind
33061=I/O Single select multi document marking |I/O select document mark
33062=Red Light Preview Processor|Red Light Preview
33063=Fast Mark|Fast Mark
33064=Copy DB Property|Copy DB Property
33065=Paste DB Property|Paste DB Property
33068=Select Sort| Select Sort
33069=Align X|Align X
33070=Align Y|Align Y
33072=Download current selcected data |Download selected
33073=Clear downloaded data|Clear  downloaded
33074=IO test
33076=Joint curve|Joint curve
33079=Optimization Sort|Optimization Sort
33086=Download I/O select document |I/O select document download
33092=Create delayer object|Delay
33093=Create input signal object|Wait Input signal
33094=Create output signal object|Output signal
33097=Draw SPlines  in  spline mode |SPline draw tool
33113=Drwa an arc |Arc tool
33115=Drwa an arc|Arc tool
33117=Drwa a circle|Circle tool
33129=Draw a dot|Dot tool
33131=Union selected objects|Union objects
33132=Ununion selected object|Ununion
33136=Auto group objects according diameter |Auto group objects 
33137=Enter rotate marking status |Rotate Mark
33138=Create motor move object|Motor move 
33139=Create motor-pos object|Set motor position 
33141=Create condition object | if...end 
33142=Create ruler objects | Ruler Tool
33143=ReName | ReName

32783=Preview the marking process|Preview
32784=Please Input new number:
32785=Please Input Obj number:
32788=Complete calibration|Calibrate
32791=Delete selected objects|Delete
32793=please selecte object
32794=please copy double head property!
32795=create successed!
32796=Selectd %d Sort Object;| Tatol Object Is:%d;|Is Sort?
32804=Zoom out a drawing|Zoom out
32805=Zoom in a drawing|Zoom in
32807=Zoom all objects in a drawing|Zoom all objects
32808=Zoom selected objects|Zoom selected objects
32809=Dispaly all pages|Zoom all pages
32813=Draw a rectangle|Rectangle tool
32814=Drwa a ellipse or circle|Ellipse tool
32815=Draw a symmetric polygon|Polygon tool
32816=Draw a group of rectangles|Grid
32820=Fill in an object|Fill
32821=Select an object,transform an object|Select
32828=Group selected objects|Group
32829=Ungroup selected objects|Ungroup
32832=Set optional parameters|Option
32839=set mark range|Mark range
32841=Set hardware configuration of marker|Hardware configuration
32842=Marking system hardware config|touch signal
32844=Change position|Position
32845=Change angle|Rotate
32846=Change scale and mirror|Scale
32847=Change size|Size
32901=Center the selected object|Center
32907=X-mirror the selected object|X-mirror
32908=Y-mirror the selected object|Y-mirror
32913=Rotate the selected object 90 degrees counter-clockwise|Rotate 90 degrees counter-clockwise
32914=Rotate the selected object 90 degrees clockwise|Rotate 90 degrees clockwise
32916=Set tracker property|Set tracker
32917=Show or hide layer setup bar|Show/Hide layer setup bar
32919=Create barcode|Barcode tool
32920=Load Template
32921=Export Template
32938=Set relative center|Relative center
32939=Set flying marking parameters|Flying mark
32940=Array the designated objects|Array
32943=Set marking range using traditional method|Marking range
32944=No Find Font
32949=Align the selected mutiple objects|Align
32951=Initialize laser marker to multi-document marking status|Multi-document mark
32953=Open multiple existing documents|Multi-document
32954=Bitmap marking property|Bitmap
32956=Display total marking time and times|Display marking statistic data
32957=Name
32958=Type
32959=Number
32964=Non-proportional zoom|Zoom
32965=unknow
32966=line
32967=Rect
32968=text
32969=jump text
32970=ellipse
32971=grid
32972=polygon
32973=codebar
32974=group
32976=Delayer
32977=InSignal
32978=OutSignal
32979=Send the current document|Send the current document
32980=Send all documents|Send all documents
32981=Set low-level marking parameters|Set low-level marking parameters
32982=If
32983=End
32995=Create two-dimensional barcode|Two-dimensional barcode tool
32997=Create two-dimensional barcode|Two-dimensional barcode tool
32998=Create text related to barcode|Barcode text
33001=Gray-Current Compensate|Compensate
33002=Setting Gray Nonlinear Compensate

214=No item selected!
215=The current control card version is too low!
216=Control card initialization failed, the system is about to exit!
217=The device library version is incorrect. The system is about to exit!
218=This document has a serial object, and cannot be associated repeatedly!
219=Illegal parameter!
220=Unsupported file type!
306=Import a drawing file|Import
307=Draw lines or curves in hand draw mode |Hand draw tool
308=Set text and serial|Text and serial
309=     
310=     
311=The selected object include text or barcode, are you sure convert to line?
312=The number of  measuerline over max value, can't add new!
313=Sorry, no matching document !
566=8bit byte
567=KANJI
568=GB2312
1700=Scale had reached minimum, invalid operation canceled!
1701=Open gray para failure!
1702=Save repair file failure!
1703=Can't find it!
1704=Create input folder fail.| please check hard disk.
1705=The folder have files:
1706=,|Old file:
1707=|Replace or rename?
1708=default user is not exist! please input user name and password.
1709=can not find user info[OK] super user login[cancel] exist!
1710=can not find user infomation!
2070=Convex Surface
2071=Inner Surface
29141=User:
29142=Pos:
29143=frame lenght:
29144=can not find user!
29145=user name or password error!
29146=User no manager right, operate was prohibited!
29147=password can not be null!
29148=password error!
29149=user name is null!
29150=can not find user!
29151=Sorry,the old password error!
29153=Object list
29154=Special List
29155=Set
29156=Fill Edit
29157=DbHead
29158=Sort Object
31460=An error occurs when adding parameter scheme!
31461=Please select a parameter scheme!
31462=Cannot change the selected parameter scheme!
31463=Cannot delete the selected parameter scheme
31464=The current parameter set is saved as the default values. When a new file is opened next time,
|marking parameters will be set to these values. Are you sure?
31465=An error occurs when setting to default values!
31466=Please enter a correct scheme name!
31467=The name already exists, overwrite it?
31468=External file import
31469=Unrecongnized file format or loading file failed!
31470=No object is being drawn!
31479=Start(&M)
31480=Pause
31482=Timer define error!
31484=OLE Initial fail, please affirm OLE LIB is OK!
31485=Draw
31487=Change
31488=generally
31489=click center point zoom in
31490=click center point zoom out

98=HBM Marking Control Software V4.0.1
99=|BS|BS|BS File (*.bs)|.bs|BS.Document|BS Document

100 =Laser Control
101= HANS Edit Software
102 =|BS|BS|BS(*.bs)|.bs|BS.Document|BS Document
103=CCD
104=Pos Cali
105=CaliBox:     
106=Show or hide property bar| Show/Hide property bar
107=Please select object  first!
108=Drag
109=Add new dot !
110=Edit dot !
111=Delete dot !
112=Select multiple objects cmd
113=Selected other Object!
114=Save current Document
115=Display or hide toolbar|Display or hide toolbar
116=Object Property
117=Mark Para
118=Are you sure convert it to line?
119=Load dll error!
120=Function
121=Activation
122=Bitmap Mark
123=Motion
124=Precision Calibrate
125=Multi-Card
126=Enable
127=Disable
128=Are you sure exit current program and start Advance mark?
129=NG->Continue
130=Show or hide change toolbar|Show/Hide change toolbar
131=Show or hide draw toolbar|Show/Hide draw toolbar
132=Show or hide zoom toolbar|Show/Hide zoom toolbar
133=Notice:  Jump serial had jumped to end!
134=Function No
135=Switch card fail! Please restart the system!
136=Switch card succeess!
137=One dongle had binded to multiple cards,Please rebind it!   
138=Step
139=Incline
140=Column
141=Sphere
142=Taper
143=Position
144=Length
145=Width
146=3D Mark
147=DSP program version is too low,please download latest program!
148=Mark Time:
149=Positive-Limit
150=Motor Pos:   
151=Negative-Limt
152=The index of objects does not match mark order,please sort all first!
153=The objects number not equal 20,please check file first!
154=Rotate
155=Line
156=Please restart the system to take effect!
158=Number
159=Alphanumeric
160=NG->Exit
161=MixCode
162=Set Limit Box Failed
163=Set Motor Ratio Failed
164=Current operating system is Win7 or above versions, | first start the software must run with administrator privileges! 
165=Software does not run with administrator privileges,you must assign read and write access to the software directory, or it may run error!
166=Are you sure to logout?
167=SPIRAL
168=AI
169=PDF

170=DST
171=3D MODEL
172=3D FRAME
173=Large format power correction software
174=Secondary development interface library
175=Selected card start
176=Selected card pause
177=There are no objects being drawn!
178=Weld
179=Trim
180=Intersect
181=Remove
182=Serial text
183=Network text
184=Communication connection creation error: the number of connections has reached the maximum!
185=Communication TCP connection error: creation failed!
186=Communication TCP connection error: connection failed!
187=Communication serial port connection error: creation failed!
188=Communication text refresh error: serial port failed to send, serial port is not connected, data is empty or sending timeout!
189=Communication text refresh error: serial port connection no longer exists!
190=Communication text refresh error: serial port reading failed, serial port not connected or receiving timeout!
191=Communication text refresh error: the content received by the serial port is empty!
192=Communication text refresh error: TCP sending failed!
193=Communication text refresh error: TCP connection no longer exists!
194=Communication text refresh error: TCP receiving timeout!
195=Failed to obtain the dongle function module!
196=The specified control card cannot be found. Please open its associated '.hs' document separately for operation! Card No.:
197=Not find FdichU.dll or version is incorrect!
198=The dongle has been removed, Please insert the dongle!
199=The size of vector over range!
200=Insufficient memory, copy/paste failed!
201=Failed to load user font library/function!
202=Font not found:
203=Laser In is not ready!
204=Failed to create 3D model!
205=Mode error, please reset the working mode!
206=Motion parameter error!
207=Failed to set motor delay!
208=Text replacement failed!
209=Failed to open the serial port!
210=Failed to create bitmap folder!
211=Wrong dst file size!
212=The 'LA' flag of the dst file cannot be found!
213=The end flag of the dst file cannot be found!

31491=zoom
31492=ellipse  with:%.3f high:%.3f (mm)
31493=rectangle with:%.3f high%.3f (mm)
31494=line DX:%.3f(mm) DY:%.3f(mm) distance:%.3f(mm) angle:%.3f(degree)
31495=curve start(%.3f,%.3f) end(%.3f,%.3f) (mm,mm)
31496=Move X direction:%.3f Y direction:%.3f (mm)
31497=Scale percent:%.1f%%
31498=Scale X direction percent:%.1f%%
31499=Scale Y direction percent:%.1f%%
31500=Redo
31501=Undo
31502=Move
31503=Create
31504=scale
31505=drag
31506=click
31507=delete
31508=rotate
31509=select object
31510=copy
31511=group
31512=ungroup
31513=paste
31515=grid with%.3f high:%.3f (mm)
31517=fill
31519=polygon with:%.3f high:%.3f (mm)
31520=SHX Jump
31521=Property
31522=Layer set
31523=No selected layer!
31524=can not delete layer 0!
31525=No actived document!
31526=The layer will be deleted. The corresponding layer in document is to be moved to layer0
31527=No layer is selected, try again?
31528=layer property
31529=Codebar set
31530=Object property
31551=load array infomation
31552=Save Array File
31553=Array
31554=Text And Jump Text
31555=Font
31556=Arrangement style
31586=Please save all documents first !
31587=Save multi-document settings
31588=Load multi-document settings
31589=Save multi-card document settings
31590=Please store all documents before entering multi-card marking and try again!
31591=Load multi-card document settings
31592=%%4dyear%%2dmonth%%2ddate
31593=%%Dday%%Hhour%%Mminute%%Ssecond
31599=Password error. You need reverify password.
31600=Error
31601=The password  different from the previous one.
31602=Original password incorrect !
31616=Exceed mark range!
31617=Please input filename :
31618=password error please input again.
31619=The password must be made by letter or number, length less than 20 characters!
31620=Data connecting error!
31649=Another copy is already running!
31650=Please select a target item
31652=open file error!
31658=Color
31660=Sorry, you have no right  to do this!
31698=Failed to open matrix library!
31709=The layer does not exist!
31718=Barcode
31719=Text
31720=Character
31721=Array
31724=Manager
31725=Normal User
31726=Export plt error !
31727=bind.set
32782=set control card paramater|control card
33003=Export Plt Files...
33004=Open Help File
282 = Movement parameter settings
224 = Dynamic exercise marking settings
225 = Rotating marking settings
226=Redn(F1)
227=Stop red lightn(F1)
221=pen number
222=color

;---------------------------------BEGIN: Bin\LaserSetDll.dll-----------------------------------------
[DIALOG_LASERSET]
0=hardware setting 
1=Back
2=Next
3=Save
4=Cancel

[DIALOG_POWER]
0=Step 2: hardware setting 
1=Current(%)
2=Min Current(%):
3=Max Current(%):
4=Analogue Q
5=Digital Q
6=Q type
7=Power type
8=CO2 laser power
9=General Power
10=Digital Power
11= >= 100W
12= < 100W
13=Keep Pulse
14=Frequency(KHZ)
15=Release time(us)
16=Idle Current(%):
17=Max Power
18=Compensation Current(%):
19=Laser hardware settings
20=M value setting
21=M value:
22=Adjust:
23=Normal
24=Too Big
25=Too Small

[DIALOG_MODEL]
0=Setp 4: Please select the control-mode
1=A new mode，it's unnecessary to set any delay-time for users. But there are only several lasers can use this mode.
2=Traditional Mode，every laser can use this mode.
3=Handy Mode
4=Traditional
5=The Mode of marking
6=Head Type
7=Single Head
8=Double Head

[DIALOG_LaserType]
0=Laser-type
1=YAG Laser
2=DP Laser
3=Ultraviolet Laser
4=CO2 Laser
5=Q-switched fiber Laser
6=SPI Laser
7=LD Laser
8=YLPM (HFM-H) laser
9=YLP-V2 laser
10=YLPP laser
11=HFM-A laser
12=HFM-P laser
13=HFM-R laser
14=HFM-J laser
15=MOPA Tunable Pulse Width Laser
16=continuous fiber laser
17=Ultra fast laser

[DIALOG_CONTENT]
0=Step 5: Congratulation! your setting is finished，please save the parameters.

[LaserType_Explain]
0=YAG Laser
1=DP Laser
2=Ultraviolet Laser
3=CO2 Laser
4=Q-switched fiber Laser
5=SPI Laser
6=LD Laser
7=MOPA fiber laser
8=YLP-V2 laser
9=YLPP laser
10=HFM-A laser
11=HFM-P laser
12=HFM-R laser
13=HFM-J laser
14=other

[Model_Explain]
0=CO2 Handy Mode
1=CO2 Traditional Mode
2=Adjust Q、General Power + Digital Q Traditional Mode
3=Adjust Q、General Power + Analogue Q Traditional Mode
4=Adjust Q、Digital Power + Digital Q Traditional Mode
5=Adjust Q、Digital Power + Analogue Q Traditional Mode
6=Adjust Q、EP General Power + Analogue Q Handy Mode
7=Adjust Q、EP Digital Power + Digital Q Handy Mode
8=Adjust Q、EP Digital Power + Analogue Q Handy Mode
9=IPG Mode
10=SPI Handy Mode
11=SPI Traditional Mode
12=LD Mode
13=YLP-M(HFM-H) Traditional Mode
14=YLP-M(HFM-H) Handy Model
15=YLP-V2 Traditional Mode
16=YLP-V2 Handy Model
17=YLPP Traditional Mode
18=YLPP Handy Model
19=HFM-A Traditional Mode
20=HFM-A Handy Model
21=HFM-P Traditional Mode
22=HFM-P Handy Model
23=HFM-R Traditional Mode
24=HFM-R Handy Model
25=HFM-J Traditional Mode
26=HFM-J Handy Model

[DIALOG_ScanType]
0=Step 3: Select the Galvanometer type
1=CXY
2=Other
3=Notice: CXY-Galvanometer need to be preheated.
;---------------------------------END: Bin\LaserSetDll.dll-----------------------------------------


;---------------------------------BEGIN: Bin\CardApp\HLDown-----------------------------------------
[HLDOWN_DLG_2000]
CAPTION=Multi-document mark
ID2000=IO Valid
ID1016=Switch to off-line mode after logging out
ID1013=IO Setting
ID1014=DownLoad
ID1015=Start/Stop Mark
ID1018=Save MulDoc.
ID1=Quit

[HLDOWN_DLG_2001]
CAPTION=IO Setting
ID2001=Get Current IO
ID1=Ok
ID2=Cancel

[HLDOWN_STRINGTABLE]
ID0=Sel.
ID1=FileName
ID2=IO-Valid
ID3=IO-Value
ID4=DownFlag
ID1000=Please choose the file to download!
ID1001=The current downed file will be erased. Continue? 
ID1002=Faily. Please retry!
ID1003=The result:
ID1004=%d%% of board memory space has been occupied.
ID1005=Please choose the file to set!
ID1006=Please choose the file to mark!
ID1007=The IO mandatory value can't be repeated!
ID1008=Downed
ID1009=UnDowned
ID1010=Start Mark
ID1011=Stop Mark
ID2000=Successfully!
ID2001=Transmission fault!
ID2002=Flash insufficiency!
ID2003=Flash read-in fault!
ID2004=Document data is not available!
ID2005=Document data is out of range!
ID2006=IO-Valid is not set!

;---------------------------------END: Bin\CardApp\HLDown-----------------------------------------

;---------------------------------BEGIN: Bin\HLIOCheck-----------------------------------------
[HLIOCHECK_DLG_3000]
CAPTION=IO signal detection
ID1012=Input
ID1013=Output
;---------------------------------END: Bin\HLIOCheck-----------------------------------------

;---------------------------------BEGIN: Bin\GraySet-----------------------------------------
[GRAYSET_DLG_1002]
CAPTION=Gray setting
ID1004=Project
ID1006 = Linear:
ID1842=SaveAs
ID1403=Delete
ID1005=Ctrl.Mode:
ID1007=Levels
ID1838=White
ID1001=Reset
ID1008=MarkTest
ID1837=AllLevel
ID1841=SingleLevel
ID1009=Level:
ID1010=Speed:
ID1011=Dot Dist.
ID1015=Min Adjust Power(%):
ID1016=Max Adjust Power(%):
ID1017=Linear Interpolation 
ID1019=Power Adjust
ID1020=Gray Adjust
ID1024=Begin:
ID1025=End:
ID1=Ok
ID2=Cancel

[GRAYSET_DLG_1003]
CAPTION=Save Project
ID1012=Name of project is:
ID1=Ok
ID2=Cancel

[GRAYSET_STRINGTABLE]
ID1001=Open unsuccessfully!
ID1002=Please select project to be delete!
ID1003=You can't delete default project!
ID1004=Sure delete it?
ID1005=Delete unsuccessfully!
ID1006=You can't save it as default project!
ID1007=Sure overwrite it?
ID1008=Add new project unsuccessfully!
ID1009=Power
ID1010=AjustQ
ID1011=Current
ID1012=Beeline
ID1013=Curve
ID1014=Level
ID1015=Color
ID1016=Power%
ID1017=The IPG LASER does not support gray setting!
ID1018=Power
ID1019=Freq

;---------------------------------END: Bin\GraySet-----------------------------------------

;---------------------------------BEGIN: HANSADVINTERFACE-----------------------------------------
[HANSADVINTERFACE_STRINGTABLE]
ID00=Success!
ID01=Another software is running!
ID02=The path is wrong!
ID03=Initialize device failed!
ID04=Device was not initialized!
ID05=Warning!
ID06=Command timeout!
ID07=The file can't be readed!
ID08=Specified font does not exist!     
ID09=Specified Layer does not exist!
ID10=Specified Object was not found!
ID11=Parameter error!
ID12=Operation are prohibted, Invalid state!
ID13=Memory allocation failure!
ID14=Out of mark range!
ID15=Insufficient buffer size!
ID16=Null pointer!
ID17=No matched document!
ID18=Document has been opened!
ID19=Command execute failure!
ID20=Down multi document failed!
ID21=Document's Mandatory IO must not be same!
ID22=Document already downloaded in the card!
ID23=Call function error!
ID24=Preprocess failed!
ID25=No cali file,please start cali.exe first!
ID26=Rotate split was stopped!
ID27=Out of rotate mark range!
ID28=No right!
ID29=The dongle key has expired!
ID30=Success to initialize demo version! ( Control card not found )
ID100=Unknown error!


;---------------------------------END: HANSADVINTERFACE-----------------------------------------




;---------------------------------BEGIN: Bin\DoginfoReader-----------------------------------------
[DOGINFOREADER_DLG_102]
CAPTION=DogInfoReader
ID1=Exit
ID1002=Get
ID1003=Export
ID1004=Clear


[DOGINFOREADER_STRINGTABLE]
ID102=success
ID103=fail
ID104=Read dongle information start...
ID105=Read dongle information  error...
ID106=Read dongle clock error....
ID107=Dongle clock: %.4d-%.2d-%.2d %.2d:%.2d:%.2d(%.4d-%.2d-%.2d %.2d:%.2d:%.2d)
ID108=Read dog information end...
ID109=Dongle Ver
ID110=Dongle ID
ID111=Dongle Initialize Date
ID112=Software Type
ID113=Type Ver
ID114=Card Type
ID115=Type Check Code
ID116=Limit Check Code
ID117=Support Time Statistics
ID118=Enable Time Statistics

ID119=Time Check Code
ID120=Time Used(S)
ID121=Item
ID122=Content(RButton copy item content)
ID123=Export dongle information failure, file maybe used by other program!
ID124=Dongle information had exported to D:\\HansDogInfo.DAT!!
ID125=Dongle validate date
ID126=Unlimited use	

;---------------------------------End: Bin\DoginfoReader-----------------------------------------

;---------------------------------BEGIN: Bin\3DCALI-----------------------------------------
[3DCALI_DLG_4000]
CAPTION=3D Cali
ID4004=Back Foucs
ID4006=Reset
ID4013=Generate correction table
ID4014=Mark
ID4015=Red
ID4016=Loop
ID4018=Correct type
ID4019=commmon
ID4020=Test
ID4021=Motor plane position
ID4022=Minimum position
ID4023=Maximum position
ID4024=Motor position
ID4025=Motor Incremental(0.01-5)
ID4026=Plane focus



[3DCALI_STRINGTABLE]
ID4001=Motor position
ID4002=Focus
ID4003=Start Mark
ID4004=Stop
ID4005=Are you sure to generate a new correction table?
ID4006=Before correction, the focus mode in [setting -> correction parameter setting] must be set to 'f-thea Back'. Click 'yes' to continue and 'no' to exit 3D cali
ID4007=After setting, please change the focus mode in [setting -> correction parameter setting] back to 'Dynamic focusing
;---------------------------------END: Bin\3DCALI-----------------------------------------

;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION=HL Calibrate Software
ID1022=Project collection
ID1023=Sel.:
ID1007=SaveAs
ID1017=Del.
ID1084=Import
ID1085=Export

ID1075=Head
ID1024=Base
ID1025=Cali.Range(mm):
ID1026=Mark.Range(mm):
ID1072=Coord.
ID1077=R.Angle
ID1079=Off.X(mm)
ID1080=Off.Y(mm)
ID1119=Galvanometer1=X
ID1120=Galvanometer2=X
ID1116=Reverse
ID1117=Reverse

ID1030=Level Cali(Select the zoom ratio and double-click to pop up the automatic calculation window)
ID1009=New Level
ID1010=Del.Level
ID1012=Test All
ID1031=TestLayer:
ID1018=Only Max Level Mark Text

ID1053=Red Cali.
ID1043=Used
ID1054=X Scale:
ID1055=Y Scale:
ID1056=X Offset(mm):
ID1057=Y Offset(mm):

ID1058=Focus
ID1065=Mirror Type:
ID1059=Type
ID1060=Ctrl Mode
ID1061=Mirr Dist(mm)
ID1082=Dist between head && worktable(mm)
ID1063=MicroAdjust(um)
ID1062=AutoFocus ratio

ID1011=Test F7
ID1037=Stop
ID1014=Para>>

ID1109=Cali Type
ID1099=Normal Cali
ID1100=Super Cali 1
ID1101=Super Cali
ID1110= Normal calibrate, adjust axis and box size
ID1114=Import CaliData

ID1089=Super Cali
ID1086=Mark Matrix
ID1111=First step: Mark Matrix
ID1112=Second step: Import cali data 
ID1113=Third step: Make super cali file

ID1096=Scale
ID1027=Effective mark range
ID1097=Concave
ID1028=Test Box range(mm):
ID1091=Import Data from scnner
ID1087=Import Data from vision measurement system 
ID1016=Make super cali file
ID1=Ok
ID2=Cancel
ID1142=Marking control

[CALISET_DLG_167]
CAPTION=Import super cali data
ID1114=The file of X position：
ID1115=The file of Y position：
ID1=Ok
ID2=Cancel

[CALISET_DLG_159]
CAPTION=Save project
ID1036=The name of project is:
ID1=Ok
ID2=Cancel

[CALISET_DLG_131]
CAPTION=Marking Para
ID1032=Mark count:
ID1033=Mark V.(mm/s)
ID1034=Q Frequent(KHz)
ID1035=PowerCurrent
ID1036=Q Release(us)
ID1037=Laser off delay (us)
ID1139=Generate correction table
ID1=Ok
ID2=Cancel

[CALISET_DLG_160]
CAPTION=Set matrix mark
ID1093=Row
ID1094=Col
ID1116=Only Set
ID1=Ok
ID2=Cancel

[CALISET_DLG_164]
CAPTION=Select control card
ID1098=Please select working card:
ID1=Ok
ID2=Cancel

[CALISET_STRINGTABLE]
ID0=BOX size(mm)
ID1=X zoom%
ID2=Y zoom%
ID3=X conca
ID4=Y conca
ID5=X trape
ID6=Y trape
ID7=X paral
ID8=Y paral
ID9=X+ rate%
ID10=X- rate%
ID11=Y+ rate%
ID12=Y- rate%
ID13=Para\Level
ID14=Current(A)
ID15=Power(%)
ID16=Current(%)
ID17=Pulse(ns)
ID18=Mode
ID999=Marking softwar or calibrate has been start. Please close it first!
ID1000=Marking library file is missing or damaged, please make sure the software is proper!
ID1001=Initialize control board unsuccessfully!
ID1002=configuration of Marking control board is unsuccessful!
ID1003=Please select the level to be tested!
ID1004=Operation failed, retry!
ID1005=Existed project, overwrited?	
ID1006=Calibration range mustn't be zero0!	
ID1007=Marking range mustn't be zero!
ID1008=Wrong coefficient of proportionality, calibration range must bigger than %.3f times of marking!
ID1009=Apply
ID1010=Edit
ID1011=Please select the level to be deleted!
ID1012=Delete unsuccessfully! Please remain one level at least.
ID1013=File error!
ID1014=Set the calibration data to the card unsuccessfully, retry!!	
ID1015=Version is not consistent. Begin a mandatory read?
ID1016=BOX size overstep mark range!
ID1017=BOX size can not overstep upper pole size!
ID1018=The current calibration settings have been modified.Save it?
ID1019=Read file unsuccessfully!
ID1020=Are you sure to delete this project?
ID1021=No dongle found!
ID1022=dongle found, but it's invalid!
ID1023=More than 1 valid dongle inserted!
ID1024=Failed to convert initial dongle into running dongle!
ID1025="Software license expired. Please contact customer service personnel of Han's Laser to re-apply licensed patches matching (dongle ID=%s, check code=%s)."
ID1026="D160"
ID1027="D480"
ID1028="CO2_Strong"
ID1029="CO2_Tradition"
ID1030="Mark faily!"
ID1031=BOX size can not be less than next pole size!
ID1032=Out of valid calibration range!
ID1033="f-thea Back"
ID1034="Dynamic focusing"
ID1035="Normal Back"
ID1036="BOX size must be less than value of mark range subtract %d mm while general laser mode"
ID1037="Fail to get the DOG ID saving on the card. Please check whether card has been binded"
ID1038="Fail to Import"
ID1039="Import successfully"
ID1040="Fail to Export"
ID1041="Export successfully"
ID1042="Operate unsuccessfully"
ID1043="File mismatch,error file!"
ID1044="Back 3D"
ID1045="x-coordinate file path is null!"
ID1046="y-coordinate file path is null!"
ID1047="Dog ID in card  different from the ID at the dongle"
ID1048="Card ID in card is null or length error"

;---------------------------------End: EMCC\Caliset-----------------------------------------



[IDD_DIALOG_LANGUAGESET]
CAPTION=Language settings
1=OK
2=Cancel
2157=
2158=Language selection:
2139=It will only take effect after the next startup. Do you want to restart the software

[HWDRVCFG]
PAGE0=General
PAGE1=Advance
PAGE2=Special
CNT=MarkCount
ASV=MarkSpeed(mm/s)
ESV=JumpSpeed(mm/s)
QSF=Q Frequency(KHz)
QRT=Q Release(us)
LDT=LayerDelay(us)
MQR=MarkQuality
ODL=LaserOnDelay(us)
FDL=LaserOffDelay(us)
MLT=MoveLineDelay(us)
JDL=JumpDelay(us)
MDL=CornerDelay(us)
WAT=Current(%)
FPT=FPK Time(us)
FIP=FPKInitRate
FAP=FPKLenRate
FMP=FPKMaxPRate
FCR=FPKCurRate
CUR=Current(%)
POW=Power(%)
SMC=SimmerCurrent(%)
WAF=WaveForm
PLS=LaserMode
SMP=SimmerPower(%)
PLW=LaserPulse(ns)

[IDD_DIALOG_MOTIONSET]
CAPTION = movement parameter settings
679=exit
2156=save
2153 =

[IDD_DIALOG_TEXT_LOG_SET]
CAPTION = log settings
1 = OK
2 = cancel
2149 = Browse
2150 =
2208 = file path
2151 = Output text to the specified file during processing
2152 = During processing output time to the specified file
2153 = Check whether the text has been labeled
2154 = Browse
2155 = Browse

[PLUSE_DIVISION]
PulseNum = PulseNum
DivideRate = DivideRate

[IDD_SELECT_POS]
CAPTION=Select the reference for the coordinates
1=OK
2=Cancel
1031=
1032=
1033=
1034=
1035=
1036=
1037=
1038=
1039=

[IDD_CARD_RUNTIP]
CAPTION=Control card operation information
1984=DA card 1 function and version information
1979=DA Card 1 No information!
1980=DA card 2 function and version information
1981=
1982=LASER card function and version information
1835=alarm
2157=normal
2158=Y: Alarm off laser enable
2159=N: Alarm off, laser not enabled

[IDD_DIALOG_KEYBINDSET]
CAPTION=Shortcut Key Binding
1=Save
2=Off
2168=
1266=Edit
1186=Delete
2176=

[IDD_DIALOG_RESETKEYBIND]
CAPTION=Shortcut command modification
1=OK
2=Cancel
2170=HotKey:
2173=Clear
683=
2177=(Example: CTRL+ATL+Q)
2178=command:

[IDD_DIALOG_FILTERPOINTSET]
CAPTION=Filter Point Settings
1=Filter point
2=Exit
2158=filter point accuracy:
2159=filter point angle:
2116=mm
2104=°

[IDD_DIALOG_CURVEMERGE]
CAPTION=Adjacent Curve Merge Settings
1=Merge adjacent curves
2=Exit
2157=maximum distance for curve merging

[IDD_DIALOG_CHANGESKIN]
CAPTION=Skin Settings
1=Replace
2=exit
2163=
2164=
2162=skin style
2165=title
2166=skin preview
